[
    {
        "ID": 140,
        "Document": " تايلور سويفت هي مغنية وكاتبة أغاني أمريكية تُعد واحدة من أبرز الشخصيات في عالم الموسيقى. بدأت مسيرتها كمغنية كانتري قبل أن تتحول إلى البوب، محققة نجاحاً ساحقاً بألبوماتها. تُعرف سويفت بكلمات أغانيها التي تعبر عن المشاعر الشخصية وقصص الحب، مما جعل جمهورها يشعر بارتباط عاطفي معها. استطاعت أن تفوز بعدد كبير من الجوائز مثل غرامي، وتُعتبر مصدر إلهام للعديد من الفنانين الشباب. بجانب موسيقاها، تُعرف تايلور بدفاعها عن حقوق الفنانين وسعيها لتحسين علاقتهم مع شركات الإنتاج. على مر السنوات، نمت شخصيتها الفنية من فتاة شابة تكتب عن الحب إلى امرأة ناضجة تتناول قضايا اجتماعية وإنسانية في أعمالها. تأثيرها يمتد إلى خارج عالم الموسيقى من خلال أعمالها الخيرية ودعمها لقضايا مثل حقوق المرأة والمساواة.",
        "Summary": "تايلور سويفت مغنية متعددة المواهب تجمع بين الموسيقى والرسائل الاجتماعية، وتُعتبر مصدر إلهام في الفن والعمل الإنساني.",
        "Category": "Long",
        "Topic": "Taylor Swift",
        "Split": "Test"
    },
    {
        "ID": 64,
        "Document": "رمضان هو الشهر التاسع في التقويم الهجري وأحد أعظم الشهور في الإسلام، يمتاز بأجوائه الروحانية وعباداته المميزة التي تجمع المسلمين حول العالم، وهو فرصة للتقرب من الله، تعزيز الإيمان، وتنقية النفس من الذنوب. يُصوم المسلمون من طلوع الفجر حتى غروب الشمس، ممتنعين عن الطعام والشراب وكل ما يُفسد الصوم، كتمرين على ضبط النفس والابتعاد عن المحرمات، ولتعزيز الشعور بنعم الله والتعاطف مع الفقراء. يُخصص رمضان للعبادات مثل الصلاة وقراءة القرآن، حيث تُعد صلاة التراويح من أبرز سماته، ويحرص المسلمون على ختم القرآن خلال الشهر. كما يُركز الشهر على الصدقة والإحسان، فتُؤدى الزكاة وتُقام موائد الإفطار الجماعية لإطعام الصائمين. الأجواء الاجتماعية تضفي طابعًا مميزًا برفقة العائلات على موائد الإفطار والسحور، مع الأطباق التقليدية المختلفة حسب الثقافات. العشر الأواخر من رمضان تحمل مكانة خاصة، حيث تزداد العبادة، ويُحيي المسلمون ليلة القدر، التي تُعتبر أفضل ليلة في العام، بعبادة تعادل ألف شهر. رمضان يعزز القيم الإنسانية مثل الصبر، التضامن، والتواضع، مذكّرًا بمعاناة الآخرين ومحفزًا لتحسين المجتمع. مع نهايته، يحتفل المسلمون بعيد الفطر المبارك بصلاة العيد وزيارة الأهل والأصدقاء وتوزيع الحلويات، كتتويج للجهود التي بذلوها خلال الشهر وفرصة لتجديد النوايا بروح جديدة.",
        "Summary": "رمضان هو شهر مميز في الإسلام يجمع بين العبادة، الصيام، التضامن الاجتماعي، والاحتفال بالقيم الإنسانية. يمثل فرصة للتقرب من الله، تعزيز الروابط الأسرية، ومساعدة المحتاجين، مما يجعله تجربة روحانية وإنسانية فريدة.",
        "Category": "Long",
        "Topic": "رمضان شهر الروحانية والتضامن",
        "Split": "Train"
    },
    {
        "ID": 150,
        "Document": "مسلسل بيكي بلايندرز هو دراما بريطانية تدور أحداثها في برمنغهام بعد الحرب العالمية الأولى. يركز المسلسل على عائلة شيلبي، وهي عصابة إجرامية تسعى لتوسيع نفوذها. يتميز المسلسل بتمثيل قوي وأزياء تاريخية مميزة، مع حبكة مليئة بالمكائد والصراعات.",
        "Summary": "بيكي بلايندرز مسلسل بريطاني شهير يجمع بين الجريمة والدراما التاريخية، مع شخصيات معقدة وحبكة مشوقة.",
        "Category": "Short",
        "Topic": "peaky blinders",
        "Split": "Train"
    },
    {
        "ID": 149,
        "Document": "الآيفون هو أحد أكثر الهواتف الذكية شهرة، وهو منتج من شركة آبل. يتميز بتصميمه الأنيق وأدائه القوي. يجمع بين نظام تشغيل iOS السهل الاستخدام والمليء بالتطبيقات المفيدة. يُعرف الآيفون بجودة الكاميرا العالية، مما يجعله خياراً مفضلاً لعشاق التصوير. يقدم الآيفون ميزات أمان قوية مثل بصمة الوجه والتشفير، ويُعتبر رمزاً للابتكار والتكنولوجيا الحديثة. رغم ارتفاع سعره، فإن جودة المنتج والخدمات المقدمة تعوض ذلك، مما يجعله استثماراً مميزاً للمستخدمين",
        "Summary": "الآيفون جهاز ذكي يجمع بين التصميم الراقي والأداء القوي، ويُعتبر رمزاً للابتكار في عالم التكنولوجيا.",
        "Category": "Long",
        "Topic": "Iphones",
        "Split": "Train"
    },
    {
        "ID": 83,
        "Document": "فاكهة اليوسفي، أو المندرين، هي واحدة من أشهر الفواكه الحمضية المعروفة بطعمها الحلو وسهولة تقشيرها، وتعود أصولها إلى جنوب شرق آسيا، خصوصًا الصين، حيث زُرعت منذ آلاف السنين. اسم مندرين مشتق من أردية المسؤولين الصينيين البرتقالية، وانتقلت الفاكهة عبر التجارة إلى الهند ودول جنوب آسيا ثم إلى العالم. وصلت إلى أوروبا وأمريكا الشمالية في القرن التاسع عشر، حيث اكتسبت شعبية كبيرة بفضل حجمها الصغير ونكهتها المميزة، وهي تُزرع الآن في مناطق متعددة مثل إسبانيا، المغرب، والولايات المتحدة.",
        "Summary": "فاكهة اليوسفي، التي نشأت في الصين، انتشرت عالميًا عبر التجارة، واكتسبت شعبية كبيرة بفضل مذاقها الحلو وسهولة تناولها.",
        "Category": "Long",
        "Topic": "أصل فاكهة اليوسفي ",
        "Split": "Train"
    },
    {
        "ID": 94,
        "Document": "دور الآباء في حياة الأسرة هو دور محوري ومهم يؤثر على نمو الأطفال واستقرار الأسرة بشكل عام. الأب ليس فقط مصدرًا للرعاية المادية، بل يلعب أيضًا دورًا أساسيًا في توجيه الأسرة وتوفير الدعم النفسي والعاطفي. على مر العصور، تغيرت أدوار الآباء لتتناسب مع متطلبات العصر، مما أضاف أبعادًا جديدة لدورهم التقليدي. يُعتبر الأب نموذجًا يحتذي به الأبناء في سلوكهم وقيمهم. من خلال تصرفاته اليومية، يتعلم الأطفال مفاهيم مثل الصدق، المسؤولية، والاجتهاد. يساعد وجود الأب الفعّال في حياة الأطفال على تعزيز ثقتهم بأنفسهم وتطوير شخصياتهم بطريقة متوازنة. كما يلعب دورًا مهمًا في تعليم الأبناء كيفية التعامل مع التحديات وتحقيق أهدافهم. إلى جانب الدور التربوي، يُعتبر الدعم العاطفي الذي يوفره الأب لأسرته من الأمور الأساسية. الأطفال الذين يحظون بعلاقة قوية مع آبائهم يكونون أكثر قدرة على مواجهة التحديات النفسية والاجتماعية. التواجد العاطفي للأب يُشعر الأطفال بالأمان والانتماء، مما يعزز من صحتهم النفسية. في الأسرة الحديثة، يتعاون الآباء بشكل أكبر مع الأمهات في تربية الأطفال وتحمل المسؤوليات اليومية. هذه الشراكة تخلق بيئة أسرية متوازنة وتساهم في تعزيز الاستقرار داخل الأسرة. عندما يتقاسم الأب والأم الأدوار بشكل عادل، يكون لذلك تأثير إيجابي على الأطفال ويُعزز من مفهوم العمل الجماعي. على مستوى أوسع، يُسهم الآباء في بناء مجتمعات قوية ومستقرة. دور الأب في تربية أفراد مسؤولين ومتحملين للمسؤولية ينعكس بشكل مباشر على المجتمع. كما أن الآباء الذين يشاركون في أنشطة مجتمعية يُعدّون قدوة إيجابية تلهم الآخرين.",
        "Summary": "دور الآباء يشمل الدعم العاطفي والتوجيه التربوي إلى جانب توفير الاحتياجات المادية. بتعاون متوازن مع الأمهات، يسهمون في استقرار الأسرة، تعزيز ثقة الأطفال بأنفسهم، وترسيخ قيم المسؤولية، مما ينعكس إيجابيًا على المجتمع ككل.",
        "Category": "Medium",
        "Topic": "دور الآباء في الأسرة والمجتمع",
        "Split": "Train"
    },
    {
        "ID": 60,
        "Document": "الأرض هي كوكبنا الوحيد الذي يوفر البيئة الملائمة للحياة، حيث يزخر بتنوع طبيعي يشمل المحيطات، الجبال، الصحاري، والغابات، مما يجعلها غنية بالجمال والتنوع، مع تغطية المياه لثلاثة أرباع سطحها، ما يجعلها عنصرًا أساسيًا لاستمرار الحياة. رغم ذلك، تواجه الأرض تحديات كبيرة مثل التغير المناخي، التلوث، وتدمير الموائل، ما يهدد التوازن البيئي ويدعو إلى اتخاذ إجراءات لحماية الكوكب، إذ إن الحفاظ على الأرض مسؤولية جماعية تتطلب تعاون الحكومات والأفراد معًا.",
        "Summary": "الأرض كوكب الحياة، وتواجه تحديات بيئية تتطلب التعاون للحفاظ على توازنها وجمالها.",
        "Category": "Short",
        "Topic": "الأرض كوكب الحياة",
        "Split": "Test"
    },
    {
        "ID": 27,
        "Document": "القهوة ليست مجرد مشروب صباحي، بل هي ثقافة متجذرة في حياة الشعوب. منذ اكتشافها في إثيوبيا، انتشرت القهوة إلى جميع أنحاء العالم وأصبحت رمزًا للضيافة واللقاءات الاجتماعية. في العالم العربي، تعتبر القهوة العربية رمزًا للكرم، حيث تقدم في المجالس الخليجية مع التمر كجزء من التقاليد. أما في تركيا، فقد تطورت ثقافة القهوة لتصبح جزءًا من التراث الثقافي، حيث تعكس فنا في إعدادها وتقديمها، بينما في أوروبا، وخاصة في إيطاليا، تمثل القهوة جزءًا من الروتين اليومي ويُعتبر الإسبريسو من أشهر المشروبات هناك. القهوة لها فوائد صحية متعددة، فهي مصدر غني بمضادات الأكسدة وتساعد في تحسين التركيز وزيادة النشاط، وتشير بعض الدراسات إلى أن القهوة قد تقلل من مخاطر الإصابة بأمراض مثل الزهايمر والسكري من النوع الثاني، لكن، مثل أي شيء، يجب استهلاكها باعتدال لتجنب الآثار السلبية مثل الأرق أو ارتفاع ضغط الدم. أصبحت القهوة أيضًا جزءًا من الثقافة الحديثة، حيث انتشرت المقاهي حول العالم كمكان للتواصل والعمل، وأسماء شهيرة مثل ستاربكس أو كافيه نيرو أصبحت رموزًا لهذه الثقافة الجديدة. القهوة ليست فقط مشروبًا، بل هي تجربة تجمع بين التقاليد والتحديث",
        "Summary": "يتحدث النص عن القهوة كأكثر من مجرد مشروب، موضحًا رمزيتها الثقافية وفوائدها الصحية، مع الإشارة إلى أهمية الاعتدال في استهلاكها.",
        "Category": "Long",
        "Topic": "القهوة أكثر من مجرد مشروب",
        "Split": "Train"
    },
    {
        "ID": 146,
        "Document": " الكارما مفهوم روحي يشير إلى قانون السبب والنتيجة، حيث تؤدي الأفعال الجيدة إلى نتائج إيجابية والأفعال السيئة إلى نتائج سلبية. يُعتبر مبدأً أخلاقياً يدفع الناس للتفكير في عواقب أفعالهم.",
        "Summary": "الكارما قانون روحي يعكس تأثير الأفعال على حياة الأفراد من خلال النتائج الإيجابية أو السلبية.",
        "Category": "Short",
        "Topic": "Karma",
        "Split": "Test"
    },
    {
        "ID": 47,
        "Document": "الأساطير اليابانية هي جزء لا يتجزأ من ثقافة اليابان وهويتها، تجمع بين العناصر الروحية والقصص الشعبية، وتمتلئ بالآلهة، الأرواح، والمخلوقات التي تجسد الطبيعة والكون، مستمدة من الشينتو، البوذية، والتقاليد الشعبية، مما يعكس رؤية اليابانيين للعالم والحياة. أحد الأساطير الأساسية هي قصة الخلق في الشينتو التي تروي كيف خلق الزوجان الإلهيان إيزانامي وإيزاناجي اليابان باستخدام رمح مقدس، ومن زواجهما وُلدت العديد من الآلهة، أبرزها أماتيراسو، إلهة الشمس ورمز النور والحياة، التي يُقال إن الإمبراطور الياباني ينحدر من سلالتها الإلهية، مما يمنحه مكانة مقدسة. إلى جانب أماتيراسو، تضم الأساطير تسوكويومي، إله القمر، وسوسانو، إله العواصف والبحر، الذي يمثل الشخصية المتمردة ويمتلك قصصًا مثل هزيمته للوحش ياماتا نو أوروتشي. تشمل الأساطير أيضًا الأرواح والمخلوقات الخارقة المعروفة باليوكاي، التي تتنوع بين المرح والمساعدة، مثل كيتسوني، أو المخيفة مثل أوني، الشياطين التي تمثل الشر والعقاب. البوذية أثرت على الأساطير بقصص مثل جوزو، إله الحماية الذي يرعى أرواح الأطفال، مما خلق تنوعًا فريدًا حيث تتداخل الشخصيات والمفاهيم بين الشينتو والبوذية. الطبيعة لها دور مركزي في الأساطير، حيث تُعتبر الجبال، الأنهار، والأشجار مقدسة وغالبًا ما تكون موطنًا للآلهة أو الأرواح، مثل جبل فوجي الذي يحمل مكانة خاصة في العديد من القصص. تنعكس الأساطير اليابانية في الفنون والأدب بأعمال مثل حكاية الأمير مونونوكي ورحلة تشيهيرو التي تعكس العلاقة بين الإنسان والطبيعة، وهي فكرة متجذرة بعمق في الثقافة اليابانية. في العصر الحديث، لا تزال الأساطير تحظى بتقدير كبير وتُستخدم كمصدر إلهام للأدب، الأفلام، وألعاب الفيديو، حيث تتحدث عن الشجاعة، التضحية، والصراع بين الخير والشر، مما يجعلها جزءًا حيًا من الحياة اليومية.",
        "Summary": "يستعرض النص أساطير اليابان، بدءًا من قصة الخلق وآلهة الشينتو مثل أماتيراسو وسوسانو، وصولًا إلى الأرواح والمخلوقات مثل اليوكاي. يركز النص على تأثير الطبيعة والبوذية على الأساطير، مع الإشارة إلى انعكاسها في الفنون والثقافة اليابانية الحديثة.",
        "Category": "Long",
        "Topic": "أساطير اليابان عالم من الآلهة والأرواح",
        "Split": "Train"
    },
    {
        "ID": 130,
        "Document": " أخيل هو أحد أشهر الشخصيات في الأساطير اليونانية، اشتهر ببطولته في حرب طروادة. وُلد أخيل لأم إلهة البحر ثيتيس ووالده الملك بيلوس، مما جعله نصف إله. وفقاً للأسطورة، غطسته والدته في نهر ستيكس لجعله منيعاً، ولكن كعبه ظل ضعيفاً لأنه لم يغطسه بالكامل. بفضل قوته وشجاعته، أصبح أخيل محارباً لا يُقهر وقائداً مهماً في الجيش اليوناني أثناء حرب طروادة. عُرف بشجاعته في المعارك ومواجهته لأعداء أقوياء مثل هيكتور. رغم قوته، كان أخيل شخصية معقدة مليئة بالتناقضات؛ حيث أظهر جانباً عاطفياً عندما فقد صديقه المقرب باتروكلس، مما دفعه للانتقام. قُتل أخيل بعد أن أصابه باريس بسهم في كعبه الضعيف. قصة أخيل تعد رمزاً للمجد والتراجيديا، حيث أظهر أنه حتى الأقوى يمتلك نقاط ضعف .",
        "Summary": "أخيل بطل أسطوري يوناني عُرف بقوته وشجاعته، لكنه كان يحمل نقطة ضعف في كعبه أدت إلى نهايته التراجيدية.",
        "Category": "Long",
        "Topic": "Achilles",
        "Split": "Test"
    },
    {
        "ID": 18,
        "Document": "بين النجوم فيلم خيال علمي يدور حول رحلة فضائية لإنقاذ البشرية. في المستقبل، تواجه الأرض أزمات بيئية تهدد بقاء البشر. يتم إرسال فريق من رواد الفضاء عبر ثقب دودي للبحث عن كوكب يمكن للبشر العيش فيه. الفيلم يجمع بين العلم والعاطفة، ويُبرز العلاقة بين الأب كوبر وابنته مورف، ويطرح تساؤلات عن الزمن والمكان والحب.",
        "Summary": "بين النجوم فيلم خيال علمي يروي رحلة لإنقاذ البشرية من أزمة بيئية عبر استكشاف الفضاء.",
        "Category": "Short",
        "Topic": "بين النجوم",
        "Split": "Test"
    },
    {
        "ID": 17,
        "Document": " فيلم غموض وإثارة يتناول قضية وفاة الكاتب الغني هارلان ثرومبي. بعد وفاته الغامضة، يتم استدعاء المحقق الشهير بنوا بلانك للتحقيق. يكشف التحقيق أسرار العائلة وعلاقاتها المعقدة، مما يُضيف طابعًا كوميديًا وتشويقيًا. يتميز الفيلم بحبكته الذكية وحواراته الممتعة وأداء طاقم العمل.",
        "Summary": "اخرجوا السكاكين فيلم غموض يتناول تحقيقًا في وفاة غامضة يكشف أسرار عائلة مليئة بالتعقيدات.",
        "Category": "Short",
        "Topic": "اخرجوا السكاكين",
        "Split": "Train"
    },
    {
        "ID": 45,
        "Document": "العطر هو أحد أعظم الابتكارات التي عرفتها البشرية، حيث يمثل مزيجًا رائعًا من الفن والعلم، وقد لعب دورًا محوريًا في حياة الإنسان منذ العصور القديمة، معبرًا عن الثقافة والجمال والروحانية. بدأت قصة العطر باستخدام المواد الطبيعية مثل الزهور والأعشاب والتوابل في مصر القديمة، حيث كان جزءًا أساسيًا من الطقوس الدينية والحياة اليومية، واستخدم الكهنة البخور لتقديم القرابين، بينما استخدمت النساء العطور للتجميل، مع اكتشاف أدوات قديمة لاستخلاص الزيوت العطرية تعكس براعة المصريين. في الحضارة الإغريقية والرومانية، تطورت صناعة العطور لتصبح رمزًا للثروة والرفاهية، حيث استورد الرومان مواد خام مثل الزعفران والقرفة والمسك من الشرق الأوسط وآسيا واستخدموها في الحمامات والمآدب. خلال العصور الوسطى، ارتبطت العطور بالنظافة والصحة، حيث كان يُعتقد أن الروائح الطيبة تحمي من الأمراض، وتطورت تقنيات استخراج الزيوت، مما أدى إلى تحسين جودة العطور. في عصر النهضة، شهدت أوروبا ثورة في صناعة العطور، وأصبحت فرنسا مركزًا لها، خاصة في منطقة غراس، حيث تم تطوير تقنيات لتثبيت الروائح، وجعل العطر جزءًا من الحياة اليومية. في القرن الثامن عشر، تم اختراع أول عطر حديث في ألمانيا يُعرف بـكولونيا، مما جعل العطور أكثر انتشارًا مع إمكانية إنتاجها بكميات كبيرة، بينما أحدثت الثورة الصناعية في القرن التاسع عشر تطورًا كبيرًا من خلال تقنيات استخراج الروائح وإنتاج المواد الاصطناعية. في العصر الحديث، أصبحت العطور صناعة عالمية تدير مليارات الدولارات، مع شركات كبرى مثل شانيل وديور وجيفنشي التي أعادت تعريف العطر كمنتج فاخر يعبر عن الشخصية والأناقة، وتنوعت العطور لتناسب مختلف الأذواق والمناسبات. العطر ليس مجرد منتج تجميلي بل هو لغة تعبر عن المشاعر والذكريات، حيث تمتلك الروائح قدرة فريدة على استحضار اللحظات الماضية وإثارة الأحاسيس، مما يجعل اختيار العطر قرارًا شخصيًا يعكس هوية الفرد وذوقه. ورغم التقدم الكبير في الصناعة، إلا أن التحديات البيئية المتعلقة باستدامة المصادر الطبيعية واستخدام المواد الاصطناعية أصبحت محور الاهتمام، حيث تعمل الشركات على تطوير عطور مستدامة وصديقة للبيئة. في النهاية، يمثل اختراع العطر قصة إنسانية تعكس شغف الإنسان بالجمال والتعبير عن الذات، فمن مصر القديمة إلى عواصم الموضة الحديثة، استمر العطر في التطور ليصبح جزءًا لا يتجزأ من حياتنا، فهو أكثر من مجرد رائحة، إنه فن يحكي قصصًا عن الثقافات والتاريخ.",
        "Summary": "يتناول النص تاريخ اختراع العطر، من استخدامه في مصر القديمة كجزء من الطقوس الدينية، إلى تطوره في الحضارات الإغريقية والرومانية، ثم ازدهاره في أوروبا خلال عصر النهضة. يركز النص على دور العطور كمنتج يعبر عن الشخصية والجمال، مع الإشارة إلى التحديات البيئية التي تواجه الصناعة في العصر الحديث.",
        "Category": "Long",
        "Topic": "اختراع العطر رحلة عبر الزمن",
        "Split": "Train"
    },
    {
        "ID": 77,
        "Document": "الخوف هو واحدة من أكثر العواطف الأولية تأثيرًا في حياة الإنسان، إذ ينشأ كاستجابة طبيعية لحماية النفس من التهديدات أو المخاطر، ورغم كونه سلبيًا أحيانًا، فإنه يلعب دورًا حيويًا في بقاء الإنسان وتطوره. يُعرف الخوف بأنه استجابة نفسية وفسيولوجية لتحفيز معين يُعتبر خطرًا أو تهديدًا، وتتنوع شدته من القلق البسيط إلى الخوف الشديد المعروف بالرهاب. يمكن أن يكون الخوف مؤقتًا كالتوتر قبل الامتحانات أو مستمرًا كما هو الحال في اضطرابات القلق. تتعدد أسباب الخوف بين التهديدات المادية مثل الحوادث والتهديدات النفسية كالفشل أو النقد، حيث تلعب التجارب السابقة دورًا كبيرًا في تشكيل المخاوف، مثل تجربة سيئة مع الكلاب التي قد تترك أثرًا دائمًا. التقاليد والثقافة تؤثر أيضًا في تحديد أنواع المخاوف؛ فبينما تشجع بعض المجتمعات على مواجهة المخاوف، ترى أخرى فيها علامة ضعف. للخوف آثار إيجابية وسلبية؛ فمن الناحية الإيجابية، يمكن أن يحفز الإنسان على اتخاذ احتياطات أو تحسين أدائه، مثل الخوف من الرسوب الذي يدفع الطالب إلى الاجتهاد. أما سلبيًا، فإن الخوف المفرط قد يؤدي إلى الانسحاب أو مشاكل صحية كارتفاع ضغط الدم واضطرابات النوم، وفي الحالات الشديدة قد يتحول إلى فوبيا أو قلق مزمن يستدعي العلاج. التعامل مع الخوف يتطلب وعيًا ومهارات كاستخدام التنفس العميق لتهدئة الاستجابة الفسيولوجية، وتغيير الأفكار السلبية إلى إيجابية، والتعرض التدريجي لمصدر الخوف، بالإضافة إلى طلب المساعدة عند الضرورة. رغم أنه شعور مزعج، يظل الخوف ضروريًا في بعض الحالات؛ إذ يساعد على البقاء، ويمنع المخاطر، ويجعل الإنسان أكثر وعيًا بحدوده، مع أهمية التحكم فيه لضمان عدم سيطرته على الحياة.",
        "Summary": "الخوف عاطفة طبيعية ومعقدة تلعب دورًا مزدوجًا في حياة الإنسان، حيث يمكن أن يكون محفزًا يدفع إلى التحفيز والعمل أو عائقًا يسبب الشلل والانسحاب، ويعتمد تأثيره على طريقة التعامل معه، لذلك فإن التحكم في الخوف وتوجيهه بشكل إيجابي يُعد مفتاحًا للتغلب عليه وتحقيق التوازن في الحياة.",
        "Category": "Short",
        "Topic": "الخوف عاطفة إنسانية معقدة",
        "Split": "Test"
    },
    {
        "ID": 12,
        "Document": "التعليم الرقمي يُحدث ثورة في طريقة اكتساب المعرفة. مع توفر الإنترنت والتكنولوجيا الحديثة، أصبح التعلم متاحًا للجميع في أي وقت ومن أي مكان. الأدوات الرقمية مثل المنصات التعليمية والتطبيقات التفاعلية تُسهل عملية التعلم وتجعلها أكثر جاذبية. ومع ذلك، هناك تحديات تواجه هذا التحول، مثل الفجوة الرقمية بين الدول المتقدمة والنامية. بالإضافة إلى ذلك، يُمكن أن يؤدي الاعتماد الزائد على التكنولوجيا إلى تقليل التفاعل الاجتماعي بين الطلاب والمعلمين. لتحقيق الاستفادة القصوى من التحول الرقمي، يجب دمج التكنولوجيا مع الطرق التقليدية لضمان تعليم شامل ومتكامل.",
        "Summary": "التعليم الرقمي يُسهم في تحسين طرق التدريس والوصول إلى المعرفة.",
        "Category": "Medium",
        "Topic": "التحول الرقمي في التعليم",
        "Split": "Train"
    },
    {
        "ID": 158,
        "Document": "غباء الرجال مفهوم شائع يُستخدم للتعبير عن تصرفات غير مدروسة يقوم بها بعض الرجال. يمكن أن يظهر في اتخاذ قرارات دون تفكير، أو في إهمال التفاصيل الهامة. قد يكون ذلك نتيجة للضغط الاجتماعي أو قلة الوعي. التعليم والحوار قد يساعدان في تحسين الفهم وتقليل الأخطاء.",
        "Summary": "غباء الرجال يعكس التصرفات غير المدروسة، ويمكن التغلب عليه بالتعليم وزيادة الوعي.",
        "Category": "Short",
        "Topic": "men stupidity",
        "Split": "Train"
    },
    {
        "ID": 120,
        "Document": "الغضب هو شعور إنساني طبيعي ينتج عن الإحباط أو الإهانة. رغم أنه طاقة قوية يمكن أن تكون مدمرة إذا لم يتم التحكم بها، إلا أنه أحياناً يكون محفزاً للتغيير الإيجابي. القدرة على إدارة الغضب تُعتبر مهارة مهمة للحفاظ على التوازن النفسي والاجتماعي",
        "Summary": "الغضب شعور قوي يحتاج إلى إدارة صحيحة لتحويله من طاقة مدمرة إلى محفز إيجابي.",
        "Category": "Short",
        "Topic": "anger",
        "Split": "test"
    },
    {
        "ID": 19,
        "Document": "مسحور فيلم خيالي كوميدي يتناول قصة جيزيل، أميرة من عالم الرسوم المتحركة يتم نقلها إلى نيويورك الحديثة. تواجه جيزيل تحديات عديدة في هذا العالم الجديد، ولكنها تجد الحب الحقيقي مع رجل عادي. الفيلم يُظهر مزيجًا من الكوميديا والرومانسية، مع نقد لطيف لأفلام الأميرات التقليدية.",
        "Summary": "مسحور فيلم كوميدي يجمع بين الخيال والواقع، يحكي عن أميرة تجد الحب في عالم حديث.",
        "Category": "Short",
        "Topic": "مسحور",
        "Split": "Validation"
    },
    {
        "ID": 113,
        "Document": "الرؤية هي البوصلة التي توجه الإنسان نحو تحقيق أهدافه وطموحاته، فهي تمثل صورة مستقبلية لما يطمح إليه الفرد أو الجماعة. وجود رؤية واضحة يُعتبر أساساً لأي نجاح، حيث إنها تحدد المسار وتمنح الشخص الدافع للاستمرار والعمل بجدية. الرؤية ليست مجرد حلم أو أمل، بل هي تصور عملي مبني على تخطيط واستراتيجية تضعه في إطار يمكن تحقيقه. الإنسان الذي يمتلك رؤية يملك أيضاً الحافز الداخلي لمواجهة التحديات وتجاوز الصعاب. الرؤية تخلق إحساساً بالمعنى والغاية، وتجعل الجهود اليومية تصب في خدمة هدف أكبر وأسمى. على مستوى الجماعات والمؤسسات، فإن وجود رؤية مشتركة يعزز من التعاون والتناغم بين الأفراد، حيث يعمل الجميع نحو تحقيق هدف موحد. هذا يخلق بيئة عمل إيجابية ويزيد من الإنتاجية. من جهة أخرى، غياب الرؤية يؤدي إلى التشتت وضياع الجهود في اتجاهات متعارضة، مما يعيق التقدم. في النهاية، الرؤية ليست فقط أداة لتحقيق النجاح، بل هي مصدر إلهام يدفع الإنسان للارتقاء بنفسه وتحقيق أقصى إمكانياته",
        "Summary": "الرؤية هي البوصلة التي توجه الإنسان نحو تحقيق أهدافه. وجود رؤية واضحة يمنح الدافع للعمل بجدية، ويعزز التعاون والتناغم على المستوى الفردي والجماعي، بينما يؤدي غيابها إلى التشتت وضياع الجهود.",
        "Category": "Long",
        "Topic": "Vison",
        "Split": "Test"
    },
    {
        "ID": 6,
        "Document": "استكشاف الفضاء يُعد من أعظم إنجازات البشرية. منذ أول رحلة إلى القمر في عام 1969، أصبح الإنسان أكثر قربًا من فهم الكون. الرحلات الفضائية ليست مجرد مغامرة، بل هي وسيلة لاكتشاف أصول الأرض ودراسة الكواكب الأخرى. على سبيل المثال، المريخ يُعد هدفًا رئيسيًا للبعثات المستقبلية بسبب احتمالية وجود ماء عليه. استكشاف الفضاء يُسهم أيضًا في تطوير التكنولوجيا التي تُفيد حياتنا اليومية، مثل الأقمار الصناعية التي تُستخدم في الاتصالات والملاحة. ومع ذلك، فإن هذا المجال يواجه تحديات كبيرة مثل تكاليفه المرتفعة والمخاطر الصحية لرواد الفضاء. على الرغم من هذه العقبات، يظل استكشاف الفضاء مصدر إلهام لتحقيق المستحيل.",
        "Summary": "استكشاف الفضاء يُساهم في فهم الكون وتطوير التكنولوجيا.",
        "Category": "Medium",
        "Topic": "استكشاف الفضاء",
        "Split": "Train"
    },
    {
        "ID": 78,
        "Document": "رواية 1984، من تأليف جورج أورويل، تُصور مستقبلًا ديستوبيًا يهيمن فيه النظام السياسي على جميع جوانب الحياة، حيث تتابع القصة شخصية وينستون سميث الذي يعيش تحت حكم حكومة شمولية تفرض رقابة مشددة على الأفكار والسلوك، مما يجعل الرواية تسلط الضوء على مخاطر الاستبداد وتأثيره المدمر على الحرية الشخصية.",
        "Summary": "1984 تحذير من سيطرة الأنظمة الشمولية، تُبرز أهمية الحرية وحقوق الإنسان.",
        "Category": "Short",
        "Topic": "1984 لجورج أورويل",
        "Split": "Train"
    },
    {
        "ID": 110,
        "Document": "الموسيقى لا تؤثر فقط على النفس، بل أيضاً على الجسد. الإيقاعات المنتظمة تُحسن من ضربات القلب، بينما يمكن للموسيقى الحماسية أن تحفز النشاط البدني أثناء ممارسة الرياضة.",
        "Summary": "الموسيقى تؤثر على الصحة البدنية من خلال تحسين ضربات القلب وتحفيز النشاط البدني.",
        "Category": "Short",
        "Topic": "Music",
        "Split": "Tain"
    },
    {
        "ID": 103,
        "Document": "تجمع الموسيقى الناس في المناسبات الاجتماعية، سواء كانت حفلات زفاف، احتفالات وطنية، أو مهرجانات ثقافية. الأغاني الشعبية والموسيقى التقليدية تعكس هوية المجتمعات، وتسهم في تعزيز الانتماء والترابط بين الأفراد.",
        "Summary": "الموسيقى تجمع بين الأفراد وتعزز الانتماء المجتمعي، خاصة من خلال المناسبات الاجتماعية والأغاني التقليدية.",
        "Category": "Short",
        "Topic": "Music",
        "Split": "Train"
    },
    {
        "ID": 89,
        "Document": "البيانو هو آلة موسيقية كلاسيكية تُعد واحدة من أشهر الأدوات الموسيقية في العالم. يتميز البيانو بصوته الجميل وقدرته على تقديم مجموعة واسعة من الأنغام، مما يجعله أداة مفضلة للموسيقيين المحترفين والهواة. تم اختراع البيانو في القرن الثامن عشر بواسطة الإيطالي بارتولوميو كريستوفوري. يتميز البيانو بوجود مفاتيح بيضاء وسوداء تُضغط لإنتاج الأصوات، حيث يتم ضرب الأوتار الداخلية بواسطة مطارق صغيرة. هذا التصميم يجعله أداة معقدة ومتعددة الاستخدامات. البيانو يُستخدم في العديد من الأنماط الموسيقية، بدءًا من الموسيقى الكلاسيكية مثل أعمال بيتهوفن وتشايكوفسكي، إلى الجاز والموسيقى الحديثة. كما أنه يُعتبر أداة تعليمية أساسية لتعلم الموسيقى، حيث يساعد على تطوير الإحساس بالإيقاع والنغم. تأثير البيانو يمتد إلى الثقافة والفنون، حيث يُستخدم في الحفلات الموسيقية والمسارح والأفلام. بالإضافة إلى ذلك، يُعتبر عزف البيانو نشاطًا يُحسن من التركيز ويقلل من التوتر.",
        "Summary": "البيانو هو آلة موسيقية كلاسيكية تُستخدم في العديد من الأنماط الموسيقية، ويُعد أداة تعليمية وفنية تعزز الإبداع وتُضفي جمالًا على الثقافة.",
        "Category": "Short",
        "Topic": "البيانو آلة الموسيقى الكلاسيكية",
        "Split": "Train"
    },
    {
        "ID": 152,
        "Document": " أفلام الأنيميشن هي وسيلة فنية تجمع بين الترفيه والإبداع. تعتمد على تقنيات الرسوم المتحركة التي تجعل الشخصيات والقصص نابضة بالحياة. تناسب هذه الأفلام جميع الأعمار، حيث تحمل رسائل تعليمية وقيمًا إنسانية. من أشهر الأفلام توي ستوري والأسد الملك. تطورت صناعة الأنيميشن مع التكنولوجيا، مما أتاح تقديم مشاهد بصرية مذهلة وقصص ملهمة .",
        "Summary": "أفلام الأنيميشن تجمع بين الترفيه والقيم التعليمية، وهي مناسبة لجميع الأعمار بفضل تقنياتها الحديثة.",
        "Category": "Short",
        "Topic": "Animation movies",
        "Split": "Validation"
    },
    {
        "ID": 133,
        "Document": " أردوينو هو منصة إلكترونية مفتوحة المصدر تُستخدم في برمجة وإنشاء المشاريع التقنية. يعتمد على لوحات صغيرة قابلة للبرمجة تُتيح للمستخدمين التحكم بالأجهزة الإلكترونية مثل الحساسات والمحركات. يتميز بسهولة الاستخدام، مما يجعله أداة مثالية للمبتدئين والهواة في عالم الإلكترونيات.",
        "Summary": "أردوينو منصة برمجية مبتكرة وسهلة الاستخدام تُستخدم لإنشاء مشاريع إلكترونية للمبتدئين والمحترفين.",
        "Category": "Short",
        "Topic": "Arduino",
        "Split": "Train"
    },
    {
        "ID": 13,
        "Document": "مملكة السماء فيلم تاريخي يدور حول الحروب الصليبية. يُركز الفيلم على باليان، حداد يصبح فارسًا بعد وفاة والده وينخرط في الدفاع عن القدس. يعرض الفيلم صراعًا بين الأديان والثقافات، ويُبرز أهمية التسامح والسلام في مواجهة الحروب.",
        "Summary": "مملكة السماء فيلم تاريخي يروي قصة فارس يدافع عن القدس خلال الحروب الصليبية",
        "Category": "Short",
        "Topic": "مملكة السماء",
        "Split": "Validation"
    },
    {
        "ID": 111,
        "Document": "الاستماع إلى الموسيقى، خاصة الكلاسيكية أو التأملية، يُحفز الدماغ على التفكير الإبداعي. كثير من الكُتّاب والفنانين يجدون الإلهام في الموسيقى لتطوير أعمالهم الفنية.",
        "Summary": "الموسيقى تعزز التفكير الإبداعي وتلهم الفنانين لتطوير أعمال مبتكرة",
        "Category": "Short",
        "Topic": "Music",
        "Split": "Train"
    },
    {
        "ID": 62,
        "Document": "المحتالون هم أشخاص يستخدمون الخداع للحصول على المال أو المعلومات، حيث تتنوع أساليبهم من البريد الإلكتروني المزيف إلى المكالمات الهاتفية الاحتيالية، مستغلين ثقة الضحايا لتحقيق مكاسب شخصية. لتجنب الوقوع في فخ الاحتيال، يجب التحقق دائمًا من مصدر أي طلبات مالية أو معلومات شخصية، إذ تُعد التوعية المفتاح لحماية الأفراد من الخداع، مع ضرورة الإبلاغ عن الأنشطة المشبوهة للجهات المختصة.",
        "Summary": "المحتالون يستخدمون الخداع لتحقيق مكاسب، والتوعية هي أفضل وسيلة لحماية الأفراد من الاحتيال",
        "Category": "Short",
        "Topic": "المحتالون وجه آخر للجريمة",
        "Split": "Test"
    },
    {
        "ID": 72,
        "Document": "مبدأ أرخميدس، الذي اكتشفه العالم الإغريقي أرخميدس، يصف القوة الصاعدة التي تؤثر على جسم مغمور في سائل، حيث ينص على أن الجسم المغمور يتعرض لقوة دفع تعادل وزن السائل المزاح، مما يفسر لماذا تطفو السفن الثقيلة في الماء. يُستخدم هذا المبدأ في تصميم السفن والغواصات بحساب حجم الجزء المغمور لضمان استقرار المركبة، وفي تحديد كثافة المواد من خلال قياس وزنها في الهواء والماء، بالإضافة إلى تطبيقاته في الأدوات الطبية مثل الهيدروميتر لقياس كثافة السوائل. لا يعد المبدأ أداة علمية فحسب، بل هو أساس لفهم العديد من الظواهر الطبيعية، مما يساعد على تطوير تقنيات جديدة في مجالات الهندسة البحرية والفيزياء.",
        "Summary": "مبدأ أرخميدس يصف قوة الطفو التي تؤثر على الأجسام المغمورة في السوائل، وله تطبيقات واسعة في الهندسة البحرية لتصميم السفن والغواصات، وفي قياس كثافة المواد باستخدام أدوات مثل الهيدروميتر.",
        "Category": "Short",
        "Topic": "مبدأ أرخميدس",
        "Split": "Train"
    },
    {
        "ID": 160,
        "Document": " الصمت الانتقائي هو اضطراب نفسي يمنع الأفراد من التحدث في مواقف معينة رغم قدرتهم الجسدية على ذلك. يظهر غالباً في الأطفال ويتطلب علاجاً يشمل العلاج السلوكي والدعم النفسي.",
        "Summary": "الصمت الانتقائي اضطراب نفسي يحتاج إلى علاج سلوكي ودعم نفسي لتحسين التواصل.",
        "Category": "Short",
        "Topic": "Mutism",
        "Split": "Train"
    },
    {
        "ID": 128,
        "Document": " عرض الأزياء هو مجال إبداعي يجمع بين الفن والتجارة، حيث يعرض العارضون الملابس والإكسسوارات على المنصات. يتطلب هذا المجال مهارات خاصة مثل الثقة بالنفس والقدرة على التفاعل مع الجمهور. عرض الأزياء ليس مجرد عرض للملابس، بل هو وسيلة لتقديم الإلهام والتعبير عن الاتجاهات الفنية والثقافية.",
        "Summary": "عرض الأزياء مجال فني وتجاري يعكس اتجاهات الموضة، ويتطلب مهارات خاصة للتميز.",
        "Category": "Short",
        "Topic": "modeling",
        "Split": "Validation"
    },
    {
        "ID": 11,
        "Document": "العمارة الإسلامية تُعد واحدة من أروع الإنجازات الثقافية التي قدمتها الحضارة الإسلامية للعالم. بدأت العمارة الإسلامية مع انتشار الإسلام في القرن السابع الميلادي، وازدهرت خلال العصور العباسية والأموية. من أبرز المعالم التي تُجسد جمال هذه العمارة: المسجد الأموي في دمشق، وقصر الحمراء في الأندلس. العمارة الإسلامية تُبرز التوازن بين الجمال والوظيفة. تتميز باستخدام الزخارف الهندسية المعقدة والخط العربي، مما يُعطيها طابعًا فريدًا. تُعد هذه المعالم مصدر إلهام للمهندسين المعماريين حول العالم، حيث يستوحون منها تصميماتهم الحديثة.",
        "Summary": "العمارة الإسلامية تُبرز الإبداع والجمال وتعكس الثقافة الإسلامية.",
        "Category": "Long",
        "Topic": "العمارة الإسلامية",
        "Split": "Test"
    },
    {
        "ID": 74,
        "Document": "معادلة شرودنغر، التي صاغها الفيزيائي إرفين شرودنغر، تُعد حجر الزاوية في ميكانيكا الكم، حيث تصف تطور النظام الكمومي مع الزمن وترتبط الحالة الكمومية بدالة موجية تحدد احتمالات وجود الجسيم في موقع معين. فتحت المعادلة آفاقًا لفهم العالم الذري ودون الذري، وتُستخدم في دراسة الذرات والجزيئات، مما يدعم تطوير التكنولوجيا الحديثة مثل أشباه الموصلات والحوسبة الكمومية، إلى جانب دورها في تصميم مواد جديدة وفهم التفاعلات الكيميائية. معادلة شرودنغر ليست مجرد أداة رياضية بل نافذة لفهم طبيعة الكون وسلوك الجسيمات الصغيرة.",
        "Summary": "معادلة شرودنغر تصف الحالة الكمومية للجسيمات من خلال الدالة الموجية، وتُستخدم في دراسة الذرات والجزيئات، مما يساهم في تطوير التكنولوجيا الحديثة مثل أشباه الموصلات والحوسبة الكمومية، وكذلك تصميم المواد المتقدمة.",
        "Category": "Short",
        "Topic": "معادلة شرودنغر",
        "Split": "Train"
    },
    {
        "ID": 70,
        "Document": "نظرية النسبية العامة التي قدمها ألبرت أينشتاين عام 1915 تُعد من أعظم الإنجازات العلمية في القرن العشرين، حيث تصف تأثير الجاذبية على الزمكان، موضحة أن الكتل الكبيرة مثل الكواكب والنجوم تُحدث انحناءً في نسيج الزمكان، مما يؤدي إلى الظاهرة المعروفة بالجاذبية. من أبرز التنبؤات التي أثبتتها النظرية انحراف الضوء عند مروره بجانب جسم ضخم، وهو ما تم تأكيده خلال كسوف الشمس عام 1919، مما عزز مكانة النظرية في تفسير الظواهر الكونية مثل الثقوب السوداء وموجات الجاذبية، بالإضافة إلى تقديم تفسير دقيق لحركة الكواكب وظواهر مثل تمدد الزمن بالقرب من الكتل الضخمة. لا تقتصر أهمية النسبية العامة على الجانب النظري فقط، بل تمتد إلى تطبيقات عملية مثل نظام تحديد المواقع العالمي الذي يعتمد على تصحيح البيانات وفق تأثيرات النسبية لضمان دقتها.",
        "Summary": "تشرح نظرية النسبية العامة تأثير الجاذبية على الزمكان وتقدم تفسيرًا للعديد من الظواهر الكونية، مع تطبيقات عملية في حياتنا اليومية مثل نظام تحديد المواقع.",
        "Category": "Short",
        "Topic": "نظرية النسبية العامة",
        "Split": "Train"
    },
    {
        "ID": 52,
        "Document": "شخصية دراكولا تُعد من أشهر رموز الأدب والرعب، وهي تمثل مصاصي الدماء في الثقافة الشعبية، مستوحاة من خليط من الحقائق التاريخية والأساطير الشعبية. يعود أصل الشخصية إلى فلاد الثالث، المعروف بفلاد المُخوزِق، حاكم والاشيا في القرن الخامس عشر، الذي اشتهر بوحشيته ومعاملته القاسية لأعدائه باستخدام أساليب مروعة كالإعدام بالخوزقة، مما أكسبه سمعة مرعبة كمدافع شرس ضد الغزاة العثمانيين. اسم دراكولا مشتق من لقب عائلته دراكول الذي يعني التنين أو الشيطان في الرومانية، مما أضاف هالة غامضة لشخصيته. تأثرت الشخصية أيضًا بأساطير مصاصي الدماء في أوروبا الشرقية، حيث تُصور كائنات مثل الستريغوي التي تمتص دماء الأحياء وتعود للحياة بعد الموت، وهو عنصر استوحاه برام ستوكر في روايته الشهيرة دراكولا عام 1897. أضاف ستوكر عناصر خيالية جعلت دراكولا رمزًا للرعب، مثل قواه الخارقة للطبيعة وقلعته المظلمة في ترانسلفانيا، مستندًا إلى جذور واقعية مثل فلاد المُخوزِق والأساطير الشعبية. قلعة بران، التي تُعرف شعبيًا بقلعة دراكولا، أصبحت وجهة سياحية في رومانيا تضيف بُعدًا واقعيًا للأسطورة. تطورت شخصية دراكولا عبر الزمن لتأخذ أشكالًا متعددة في الأدب والسينما، بدءًا من رمز للرعب والشر إلى كائن تراجيدي يعاني من الوحدة والصراعات الداخلية، مما يعكس التغيرات في رؤية المجتمع للوحوش. من الناحية الثقافية، أصبح دراكولا رمزًا عالميًا ألهم عددًا لا يُحصى من الأفلام والأعمال الفنية، مما جعل مصاصي الدماء جزءًا أساسيًا من الثقافة الشعبية. تعكس شخصية دراكولا مخاوف الإنسان من المجهول والموت، حيث يثير مفهوم الكائن الذي يعيش إلى الأبد ويتغذى على دماء الآخرين تساؤلات فلسفية عميقة حول الحياة والخلود والطبيعة البشرية، وهو ما يجعلها شخصية خالدة تستحق الدراسة والاهتمام.",
        "Summary": "يتناول النص أصل شخصية دراكولا وتأثير فلاد المُخوزِق والأساطير الشعبية في تشكيلها، مع استعراض تطورها في الأدب والسينما كرمز عالمي للرعب والمخاوف البشرية.",
        "Category": "Long",
        "Topic": "أصل شخصية دراكولا بين التاريخ والأسطورة",
        "Split": "Train"
    },
    {
        "ID": 136,
        "Document": " تبني الحيوانات هو خطوة إنسانية تهدف إلى منح الكلاب والقطط وغيرها من الحيوانات فرصة لحياة جديدة. الملاجيء توفر هذه الحيوانات التي غالباً ما تكون ضحية للتخلي أو الإساءة. التبني يقلل من أعداد الحيوانات المشردة ويساعد في تحسين رفاهيتها. المتبنون يحصلون على رفقة مخلصة، بينما تمنح الحيوانات فرصة للعيش في بيئة آمنة ومحبة. التبني مسؤولية تتطلب التزاماً بالعناية والاهتمام.",
        "Summary": "تبني الحيوانات يمنح فرصة حياة جديدة للحيوانات المشردة ويقدم رفقة مخلصة للمتب.",
        "Category": "Medium",
        "Topic": "animal adoption",
        "Split": "Train"
    },
    {
        "ID": 97,
        "Document": "قوس قزح هو ظاهرة طبيعية رائعة تحدث عندما ينعكس الضوء وينكسر ويتشتت داخل قطرات الماء الموجودة في الغلاف الجوي. يظهر قوس قزح كأقواس ملونة تتدرج من الأحمر في الخارج إلى البنفسجي في الداخل. يُعتبر قوس قزح رمزًا للجمال والتنوع، ويُلهِم الناس عبر الثقافات منذ العصور القديمة. يحدث قوس قزح عندما يتساقط المطر ويشرق الضوء في نفس الوقت، حيث تخترق أشعة الشمس قطرات الماء وتنعكس من الداخل قبل أن تنكسر مرة أخرى عند خروجها. هذه العملية تُنتج ألوان الطيف السبعة: الأحمر، البرتقالي، الأصفر، الأخضر، الأزرق، النيلي، والبنفسجي. يمكن رؤية قوس قزح عادةً عندما تكون الشمس منخفضة في السماء. في العديد من الثقافات، يحمل قوس قزح رمزية خاصة. في الأساطير الإسكندنافية، كان يُعتبر جسرًا يربط بين الأرض والسماء، بينما يُنظر إليه في الثقافات الحديثة كرمز للأمل والسلام. رغم أنه يبدو ظاهرة بسيطة، إلا أن قوس قزح يُظهر تعقيد الفيزياء وجمال الطبيعة. إنه تذكير بأن الطبيعة مليئة بالمفاجآت الرائعة التي تجمع بين العلم والجمال.",
        "Summary": "قوس قزح هو ظاهرة طبيعية تتشكل عند انكسار الضوء في قطرات الماء، ويُنظر إليه كرمز للجمال والأمل في ثقافات عديدة",
        "Category": "Short",
        "Topic": "قوس قزح جمال الطبيعة وأسرار الفيزياء",
        "Split": "Train"
    },
    {
        "ID": 134,
        "Document": " الكاريزما هي القدرة على التأثير في الآخرين وجذبهم من خلال الحضور الشخصي والجاذبية. الأشخاص الكاريزميون يتميزون بالثقة بالنفس، مهارات التواصل، والقدرة على قراءة مشاعر الآخرين. الكاريزما ليست مجرد موهبة فطرية، بل يمكن تطويرها من خلال تحسين المهارات الاجتماعية وبناء الثقة. تُعتبر الكاريزما عاملاً مهماً في النجاح الاجتماعي والمهني، حيث تُمكن الشخص من بناء علاقات قوية وترك انطباعات إيجابية لدى الآخرين.",
        "Summary": "الكاريزما هي مزيج من الجاذبية والثقة والمهارات الاجتماعية التي تساعد على التأثير الإيجابي في الآخرين.",
        "Category": "Medium",
        "Topic": "Charisma",
        "Split": "Train"
    },
    {
        "ID": 135,
        "Document": " متاجر التسجيلات هي أماكن تُمثل عشاق الموسيقى والأصوات الكلاسيكية. رغم التطور الرقمي، لا تزال هذه المتاجر تحظى بشعبية بين محبي الأسطوانات والفينيل. تتميز بتوفير تجارب موسيقية مميزة حيث يمكن للعملاء تصفح مجموعات نادرة أو كلاسيكية. هذه المتاجر ليست مجرد أماكن للبيع، بل هي مراكز تجمع ثقافي للموسيقيين وعشاق الموسيقى. غالباً ما تُقدم حفلات صغيرة أو جلسات توقيع لفنانين. الأجواء داخلها مليئة بالحنين والموسيقى، مما يجعلها وجهة فريدة",
        "Summary": "متاجر التسجيلات تُعد وجهة ثقافية لعشاق الموسيقى التقليدية، حيث تجمع بين التسوق والاحتفال بالموسيقى.",
        "Category": "Medium",
        "Topic": "record stores",
        "Split": "Train"
    },
    {
        "ID": 147,
        "Document": " الأشباح هي كائنات غامضة تثير الفضول والخوف في آن واحد. تتعدد القصص حول ظهورها في أماكن معينة أو ارتباطها بأحداث مأساوية. يُعتبر وجود الأشباح قضية مثيرة للجدل بين العلم والمعتقدات الشعبية. تشير بعض الثقافات إلى أنها أرواح الأشخاص الذين لم يجدوا السلام، بينما ينفي العلم وجودها لعدم وجود أدلة ملموسة. تُستخدم فكرة الأشباح بشكل كبير في الأدب والسينما لخلق أجواء مشوقة.",
        "Summary": "الأشباح كائنات غامضة تُثير الجدل بين العلم والمعتقدات، وتُستخدم في الأدب لإثارة التشويق.",
        "Category": "Medium",
        "Topic": "Ghosts",
        "Split": "Train"
    },
    {
        "ID": 59,
        "Document": "الطعام ليس مجرد وسيلة للبقاء، بل هو جزء أساسي من ثقافة الإنسان، حيث يعكس كل طبق تقاليد وأذواق الشعوب المختلفة، من المطبخ الآسيوي الغني بالنكهات المميزة إلى الأطباق المتوسطية التي تتميز بمكوناتها الصحية، ما يعكس التنوع الثقافي حول العالم. بالإضافة إلى دوره الأساسي في البقاء، يلعب الطعام دورًا اجتماعيًا هامًا، حيث يجمع العائلات والأصدقاء حول الموائد للاحتفال بالمناسبات أو قضاء أوقات ممتعة. ولتعزيز الصحة، يُنصح بتناول الأطعمة الصحية مثل الفواكه والخضروات، مع الحرص على الاعتدال في استهلاك الأطعمة الدهنية والحلويات.",
        "Summary": "الطعام ضرورة ومتعة، يجمع بين التنوع الثقافي والتواصل الاجتماعي، مع التركيز على التغذية المتوازنة.",
        "Category": "Short",
        "Topic": "الطعام متعة وضرورة",
        "Split": "Train"
    },
    {
        "ID": 33,
        "Document": "مدينة الإسكندرية، عروس البحر المتوسط، ليست مجرد مدينة ساحلية جميلة، بل هي رمز لتاريخ طويل وغني يمتد عبر آلاف السنين. أسسها الإسكندر الأكبر في عام 331 قبل الميلاد وكانت مركزًا للحضارة والثقافة في العالم القديم، وشاهدًا حيًا على تعاقب الحضارات، حيث احتضنت اليونانيين والرومان والعرب وغيرهم. أحد أعظم معالمها هو مكتبتها القديمة، التي كانت واحدة من أعظم مراكز المعرفة في العالم القديم، واحتوت على آلاف المخطوطات التي غطت مختلف العلوم والفنون، وكانت تجمع العلماء من شتى أنحاء العالم لتبادل الأفكار والمعلومات. وعلى الرغم من تدمير المكتبة الأصلية، إلا أن إرثها الثقافي استمر من خلال مكتبة الإسكندرية الحديثة، التي أعيد افتتاحها عام 2002 كمركز ثقافي يضم متاحف وقاعات مؤتمرات. في العصر البطلمي، كانت الإسكندرية مركزًا للتجارة الدولية وميناءً يعج بالسفن القادمة من البحر المتوسط، ومعروفة بمنارتها الشهيرة، إحدى عجائب الدنيا السبع، التي أضاءت البحر للسفن القادمة وكانت رمزًا للقوة والتقدم. عند دخول الإسلام إلى مصر، شهدت الإسكندرية تحولات كبيرة وأصبحت جزءًا من الحضارة الإسلامية، حيث تعكس المساجد القديمة، مثل مسجد المرسي أبو العباس، تاريخها الإسلامي وروحها الثقافية الجديدة، واستمرت في التطور كمركز علمي وثقافي مهم. اليوم، تُعد الإسكندرية مركزًا ثقافيًا وسياحيًا مهمًا، حيث تعرض متاحفها مثل متحف الإسكندرية القومي مجموعة رائعة من الآثار، وتوفر شواطئها الجميلة ملاذًا للاسترخاء، بينما تضيف مهرجاناتها الثقافية مثل مهرجان الإسكندرية السينمائي لمسة من الحيوية والإبداع. الإسكندرية ليست مجرد وجهة سياحية، بل هي مزيج فريد من التاريخ والثقافة والحياة الحديثة، مما يجعلها مدينة تحكي حكايات لا تنتهي وتظل رمزًا للتنوع الثقافي والانفتاح على العالم.",
        "Summary": "يتحدث النص عن مدينة الإسكندرية وتاريخها العريق، بدءًا من تأسيسها على يد الإسكندر الأكبر، ودورها كمركز للمعرفة والتجارة في العالم القديم، وصولًا إلى تحولها في العصر الإسلامي وأهميتها الثقافية والسياحية اليوم.",
        "Category": "Long",
        "Topic": "الإسكندرية بوابة التاريخ والثقافات",
        "Split": "Train"
    },
    {
        "ID": 91,
        "Document": "الدم هو السائل الحيوي الأساسي في جسم الإنسان، يتكون من البلازما والخلايا الدموية التي تشمل كريات الدم الحمراء، كريات الدم البيضاء، والصفائح الدموية، ولكل منها دور حيوي في الحفاظ على صحة الجسم. البلازما، التي تُشكل حوالي 55% من الدم، تعمل كوسيلة لنقل المواد الغذائية والفضلات والهرمونات، بينما كريات الدم الحمراء تُنقل الأكسجين من الرئتين إلى الأنسجة وتزيل ثاني أكسيد الكربون بفضل بروتين الهيموجلوبين. كريات الدم البيضاء تشكل خط الدفاع الرئيسي في جهاز المناعة، حيث تحارب العدوى والميكروبات، وتساهم الصفائح الدموية في تخثر الدم لمنع النزيف. الدم يؤدي وظائف أساسية تشمل نقل الأكسجين والمواد الغذائية، تنظيم درجة حرارة الجسم، وتنسيق وظائف الأعضاء من خلال نقل الهرمونات. بالإضافة إلى ذلك، يعمل الدم على حماية الجسم من الأمراض عبر خلايا المناعة التي تكافح العدوى وتُزيل الخلايا التالفة. مع ذلك، هناك العديد من الأمراض المرتبطة بالدم، مثل فقر الدم الناتج عن نقص خلايا الدم الحمراء أو الهيموجلوبين، واضطرابات التخثر مثل الهيموفيليا، وسرطانات الدم مثل اللوكيميا، وكلها تؤثر على صحة الإنسان. التبرع بالدم يُعد عملًا إنسانيًا حيويًا لإنقاذ المرضى الذين يحتاجون إلى نقل الدم في حالات الطوارئ أو الجراحة، حيث يمكن لتبرع واحد أن يُنقذ حياة ثلاثة أشخاص من خلال فصل مكونات الدم الأساسية.",
        "Summary": "الدم أساس الحياة، يتكون من البلازما لنقل المواد الغذائية، وكريات الدم الحمراء لتوزيع الأكسجين، وكريات الدم البيضاء للدفاع عن الجسم، والصفائح الدموية لتخثر الدم. يسهم في تنظيم التوازن الداخلي، وحماية الجسم من الأمراض. التبرع بالدم عمل إنساني ينقذ الأرواح، مما يعكس أهميته في الحفاظ على الحياة.",
        "Category": "Long",
        "Topic": "الدم دورة الحياة في جسم الإنسان",
        "Split": "Train"
    },
    {
        "ID": 153,
        "Document": " الجمجمة البشرية هي هيكل عظمي يحمي الدماغ ويدعم الوجه. تحتوي على 22 عظمة متصلة بشكل دقيق. تلعب الجمجمة دوراً حيوياً في حماية الجهاز العصبي المركزي وتثبيت الحواس مثل النظر والسمع.",
        "Summary": "الجمجمة البشرية هي هيكل عظمي معقد يحمي الدماغ والحواس الأساسية.",
        "Category": "Short",
        "Topic": "Human Skull",
        "Split": "Train"
    },
    {
        "ID": 10,
        "Document": "الأهرامات المصرية واحدة من أعظم إنجازات الحضارة الإنسانية القديمة. بُنيت الأهرامات كقبور للفراعنة، لتكون أماكن مقدسة تحفظ أرواحهم وتضمن لهم الحياة بعد الموت، وفقًا لمعتقدات المصريين القدماء. الأهرامات الثلاثة الأكثر شهرة هي أهرامات الجيزة: خوفو، خفرع، ومنقرع. يُعتقد أن الهرم الأكبر، هرم خوفو، قد بُني في القرن السادس والعشرين قبل الميلاد، واستمر بناؤه ما يقرب من عشرين عامًا. يتكون الهرم من ملايين الكتل الحجرية التي يصل وزن بعضها إلى عدة أطنان. الأهرامات ليست مجرد هياكل حجرية ضخمة؛ فهي مليئة بالممرات والغرف التي صُممت بعناية لتخدم غرضها الديني والجنائزي. النقوش والرسوم الموجودة على جدران الأهرامات تُظهر الحياة اليومية للمصريين القدماء.",
        "Summary": "الأهرامات رمز للهندسة والابتكار في الحضارة المصرية القديمة.",
        "Category": "Long",
        "Topic": "الأهرامات المصرية",
        "Split": "Test"
    },
    {
        "ID": 139,
        "Document": " نوتيلا هي واحدة من أشهر منتجات الشوكولاتة بالبندق في العالم. تتميز بنكهتها الغنية وقوامها الكريمي الذي يجعلها مناسبة للإفطار والوجبات الخفيفة. تُعتبر نوتيلا خياراً مفضلاً للأطفال والكبار على حد سواء، حيث تُستخدم كإضافة للخبز، الكريب، أو حتى في الحلويات. تجمع بين الجودة والطعم الفريد",
        "Summary": "نوتيلا هي منتج شوكولاتة بالبندق يجمع بين الطعم الغني والجودة، ويُستخدم في الإفطار والحلويات.",
        "Category": "Short",
        "Topic": "Nutella",
        "Split": "Train"
    },
    {
        "ID": 53,
        "Document": "زهور التوليب، المعروفة بجمالها البسيط وألوانها الزاهية، تُعد واحدة من أكثر الزهور شهرة في العالم، حيث يعود أصلها إلى آسيا الوسطى لكنها أصبحت رمزًا للثقافة الهولندية منذ القرن السادس عشر. تُزرع بألوان متنوعة مثل الأحمر والأصفر والأرجواني، مما يجعلها مناسبة للتعبير عن مشاعر مختلفة كالحب والصداق. تمثل التوليب رمزًا للتجديد والربيع، إذ تزدهر في بداية الموسم بعد الشتاء البارد، وتُقام في هولندا مهرجانات سنوية تحتفي بجمالها وتجذب آلاف الزوار لمشاهدة حقولها الممتدة. إلى جانب جمالها، تحمل التوليب تاريخًا اقتصاديًا مميزًا، حيث كانت محط هوس التوليب في القرن السابع عشر عندما أصبحت سلعة مطلوبة بشدة. هذه الزهرة ليست مجرد نبات زينة، بل رمز للأمل والجمال، تترك أثرًا دائمًا في قلوب من يراها.",
        "Summary": "تتناول النص زهور التوليب، أصولها، رمزيتها، وتأثيرها الثقافي والاقتصادي، مع التركيز على ارتباطها بالربيع والجمال.",
        "Category": "Short",
        "Topic": "زهور التوليبرمز الجمال والأناقة",
        "Split": "Train"
    },
    {
        "ID": 50,
        "Document": "تحقيق العدالة في الجرائم الكبرى، مثل القتل، يُعد من أعظم التحديات التي تواجه أنظمة العدالة حول العالم، ويتطلب استخدام أساليب حديثة تجمع بين التكنولوجيا والعلم والقانون. تبدأ العملية بتأمين مسرح الجريمة، حيث يجمع المحققون الأدلة المادية مثل بصمات الأصابع، آثار الأقدام، أو الأدوات المستخدمة في الجريمة، ويتم تحليل كل عنصر بعناية لتحديد كيفية وقوع الجريمة والجهة المسؤولة عنها. الأدلة البيولوجية، مثل الحمض النووي (DNA)، تلعب دورًا حاسمًا، حيث تتيح مقارنة العينات مع قواعد البيانات تحديد أو استبعاد المشتبه بهم بدقة عالية، وقد أسهمت هذه التقنيات في حل العديد من القضايا الباردة. التكنولوجيا الحديثة أضافت بُعدًا جديدًا للتحقيقات الجنائية، من خلال الكاميرات الأمنية، الهواتف الذكية، وسائل التواصل الاجتماعي، وأنظمة التعرف على الوجه، التي تساعد على تتبع المشتبه بهم وجمع الأدلة الرقمية. إلى جانب ذلك، تُستخدم مهارات التحليل النفسي لفهم دوافع الجناة وسلوكهم، مما يساعد على تضييق دائرة المشتبه بهم. القانون يلعب دورًا أساسيًا لضمان جمع الأدلة بطريقة قانونية تُستخدم في المحكمة، مع الالتزام بحقوق المشتبه بهم مثل توفير محامٍ أثناء الاستجواب، حيث إن أي انتهاك لهذه الحقوق قد يؤدي إلى استبعاد الأدلة. المحاكم تُعتبر المرحلة النهائية لتحقيق العدالة، حيث تُعرض الأدلة أمام القضاة وهيئة المحلفين، ويُطلب من الادعاء تقديم أدلة دامغة تثبت الجريمة بما لا يدع مجالًا للشك، بينما يقدم الدفاع أدلة لتبرئة موكلهم. رغم التقدم الكبير في تقنيات التحقيق الجنائي، لا تزال التحديات قائمة، حيث تُرتكب بعض الجرائم بحرفية تجعل من الصعب جمع أدلة كافية، مما يدفع المحققين للاعتماد على المهارات التقليدية مثل الاستجواب والمراقبة الطويلة الأمد. الأعمال الأدبية والسينمائية، مثل كيف تفلت بجريمة قتل، تُظهر تعقيد التحقيقات الجنائية، لكنها غالبًا ما تبالغ في تصوير العمليات، مما يجعلها بعيدة عن الواقع. تحقيق العدالة في جرائم القتل هو عملية معقدة تتطلب تضافر الجهود بين التكنولوجيا، العلم، القانون، والتحليل النفسي، بهدف محاسبة الجناة وضمان حماية المجتمع من الجريمة.",
        "Summary": "يستعرض النص كيفية التحقيق في جرائم القتل باستخدام الأدلة المادية، التكنولوجيا الحديثة، التحليل النفسي، والقانون. يوضح أهمية كل مرحلة في تحقيق العدالة، مع الإشارة إلى التحديات التي تواجه المحققين ودور الأدب في تسليط الضوء على هذه العمليات.",
        "Category": "Long",
        "Topic": " كيفية كشف الجرائم من خلال الأنظمة الحديثة",
        "Split": "Train"
    },
    {
        "ID": 5,
        "Document": "الموسيقى الكلاسيكية تُعد من أروع أنواع الفنون التي أثرت في حياة البشر على مر العصور. تتميز هذه الموسيقى بالتركيب العميق والتنوع الكبير في الألحان، مما يجعلها قادرة على لمس مشاعر الإنسان بطرق فريدة. تعود أصول الموسيقى الكلاسيكية إلى أوروبا، حيث أبدع أعظم الموسيقيين مثل بيتهوفن وموزارت في تقديم أعمال خالدة. تُحسن الموسيقى الكلاسيكية المزاج وتُساعد على الاسترخاء والتأمل.",
        "Summary": "الموسيقى الكلاسيكية تُبرز الجمال وتُحسن المزاج.",
        "Category": "Short",
        "Topic": "جمال الموسيقى الكلاسيكية",
        "Split": "Validation"
    },
    {
        "ID": 129,
        "Document": "الأصدقاء هم جزء لا يتجزأ من حياة الإنسان، حيث يضفون البهجة والدعم في مختلف الأوقات. الصداقة تعتمد على الثقة، التفاهم، والتواصل المستمر. الأصدقاء الحقيقيون يقفون بجانبك في الأوقات الصعبة، ويشجعونك لتحقيق أهدافك. على الرغم من اختلاف الشخصيات، إلا أن التناغم المشترك يجعل الصداقة علاقة مميزة تضيف قيمة للحياة.",
        "Summary": " الأصدقاء يمثلون الدعم والفرح في حياة الإنسان، حيث تبنى الصداقة على الثقة والتفاهم المشترك.",
        "Category": "Short",
        "Topic": "freinds",
        "Split": "Train"
    },
    {
        "ID": 154,
        "Document": " التحيز الجنسي هو تصرف أو اعتقاد يميز بين الأفراد بناءً على جنسهم. يؤدي إلى عدم المساواة في الحقوق والفرص، وغالباً ما يكون موجهاً ضد النساء. مكافحته تتطلب وعيًا مجتمعيًا وتغييراً في الثقافة.",
        "Summary": "التحيز الجنسي هو تمييز بين الأفراد على أساس الجنس، ويتطلب جهوداً للحد من عدم المساواة.",
        "Category": "Short",
        "Topic": "sexism",
        "Split": "Test"
    },
    {
        "ID": 159,
        "Document": " إدارة البيانات هي عملية تنظيم وتحليل البيانات لضمان دقتها وسهولة الوصول إليها. تشمل إنشاء قواعد البيانات، تحليلها، وتأمينها. تُعد مهارة أساسية في العصر الرقمي، حيث تُستخدم في اتخاذ القرارات وتحسين الأداء.",
        "Summary": " إدارة البيانات تضمن تنظيم وتحليل المعلومات لتحسين الأداء واتخاذ قرارات مستنيرة.",
        "Category": "Short",
        "Topic": "data set management",
        "Split": "Test"
    },
    {
        "ID": 3,
        "Document": "الرياضة ليست فقط نشاطًا بدنيًا، بل هي أسلوب حياة يُعزز الصحة العامة. ممارسة التمارين بانتظام تُحسن من وظائف القلب وتزيد من اللياقة البدنية. كما تُقلل من مخاطر الأمراض المزمنة مثل السكري وأمراض القلب. بالإضافة إلى ذلك، تُساعد الرياضة على تحسين المزاج والتخلص من التوتر والقلق. لا تحتاج إلى قضاء ساعات طويلة في التمارين؛ حتى الأنشطة اليومية مثل المشي أو ركوب الدراجة يمكن أن تكون مفيدة جدًا. الرياضة هي مفتاح لحياة مليئة بالطاقة والسعادة.",
        "Summary": "الرياضة تُحسن الصحة والمزاج وتُقلل التوتر.",
        "Category": "Short",
        "Topic": "أهمية الرياضة",
        "Split": "Train"
    },
    {
        "ID": 131,
        "Document": " عصير التفاح هو مشروب طبيعي منعش يُصنع من عصر ثمار التفاح الطازجة. يتميز بنكهته الحلوة وقيمته الغذائية العالية، حيث يحتوي على الفيتامينات والمعادن مثل فيتامين  C والبوتاسيوم. يُعتبر خياراً صحياً للترطيب ومصدراً للطاقة، كما يُستخدم في وصفات الطهي والمشروبات الممزوجة ",
        "Summary": "عصير التفاح مشروب طبيعي مغذي غني بالفيتامينات، يتميز بمذاقه اللذيذ وقيمته الصحية.",
        "Category": "Medium",
        "Topic": "apple juice",
        "Split": "Train"
    },
    {
        "ID": 109,
        "Document": "تعكس الموسيقى التقليدية هوية الشعوب وقصصها. الأغاني الشعبية تُحفظ عبر الأجيال وتحمل في طياتها حكايات وقيم المجتمعات، مما يجعلها جزءاً مهماً من التراث الثقافي.",
        "Summary": "الموسيقى التقليدية تعبر عن هوية الشعوب وقيمها، مما يجعلها عنصراً أساسياً في حفظ التراث الثقافي.",
        "Category": "Short",
        "Topic": "Music",
        "Split": "Test"
    },
    {
        "ID": 118,
        "Document": "السحر يُعتبر من أقدم الممارسات الإنسانية التي ارتبطت بعالم الغموض والقوى الخارقة. منذ العصور القديمة، حاول البشر استخدام السحر لفهم الطبيعة والسيطرة على المجهول. تختلف أنواع السحر بين الثقافات، فمنها السحر الأبيض الذي يُستخدم للخير، والسحر الأسود الذي يُستخدم لأغراض ضارة. غالباً ما كان السحر مرتبطاً بالشعائر الدينية أو الروحية، حيث استُخدمت التعويذات، الرموز، والأدوات الخاصة لتحقيق الأهداف. مع مرور الزمن، أصبح السحر موضوعاً للجدل، إذ تباينت الآراء حوله بين من يراه علماً مخفياً ومن يراه خرافة. في العصور الوسطى، كان السحر يُعتبر جريمة خطيرة، مما أدى إلى اضطهاد آلاف الأشخاص تحت تهمة ممارسة السحر. اليوم، لا يزال السحر مثيراً للفضول والاهتمام، خاصة في الأدب والسينما. يُستخدم في روايات الخيال لخلق عوالم مليئة بالسحر والقوى الخارقة، مما يعكس استمرارية هذا الموروث الثقافي. رغم تقدم العلم، يبقى السحر مجالاً يثير التساؤلات حول المجهول وعلاقة الإنسان به",
        "Summary": "السحر ممارسة قديمة مليئة بالغموض، تنوعت استخداماته بين الخير والشر، ولا يزال موضوع اهتمام في الأدب والثقافة رغم تقدم العلم.",
        "Category": "Long",
        "Topic": "witchcraft",
        "Split": "Train"
    },
    {
        "ID": 4,
        "Document": "النوم المبكر من العادات الصحية التي تساهم في تحسين جودة الحياة. عندما ننام مبكرًا، يحصل الجسم على الوقت الكافي للتجديد والإصلاح، مما يعزز التركيز والطاقة خلال اليوم. تشير الدراسات إلى أن النوم الكافي يقلل من مخاطر الإصابة بالأمراض المزمنة مثل أمراض القلب والسمنة. كما يساعد النوم المبكر على تحسين المزاج وزيادة الإنتاجية. الالتزام بوقت نوم ثابت يُعزز صحة الجسد والعقل.",
        "Summary": "النوم المبكر يُعزز الصحة والطاقة والإنتاجية.",
        "Category": "Short",
        "Topic": "أهمية النوم المبكر",
        "Split": "Validation"
    },
    {
        "ID": 49,
        "Document": "السحر الأسود هو أحد أكثر المواضيع إثارة للجدل والغموض عبر التاريخ، يُشار إليه كنوع من السحر يُستخدم لأغراض شريرة أو لإلحاق الضرر بالآخرين، ويُعتبر نقيضًا للسحر الأبيض الذي يُعتقد أنه يستخدم للخير. ارتبط منذ العصور القديمة بالشياطين والأرواح الشريرة، ففي الحضارتين البابلية والمصرية القديمة كان يُعتقد أن بعض الكهنة يمتلكون قوى لاستدعاء الأرواح وإلقاء اللعنات، كما تظهر النصوص القديمة مثل كتاب الموتى المصري تعاويذ يُقال إنها تُستخدم للسيطرة على الأرواح. في العصور الوسطى، ازداد الخوف من السحر الأسود في أوروبا وربط بالهرطقة والشيطان، حيث قادت الكنيسة الكاثوليكية حملات واسعة ضد السحرة، مما أدى إلى محاكمات مثل محاكم التفتيش ومحاكمات ساحرات سالم. لا يزال السحر الأسود جزءًا من المعتقدات الشعبية في العديد من الثقافات حتى اليوم، ففي بعض المجتمعات الأفريقية يُعتقد أن السحرة يمكنهم استخدامه للتسبب في الأمراض أو سوء الحظ، وفي الهند يُعرف باسم تانترا ويُعتقد أن بعض الممارسين يستخدمونه لتحقيق أهدافهم الخاصة. التعامل مع السحر الأسود غالبًا ما يشمل طقوسًا معقدة مثل استدعاء الأرواح واستخدام الأعشاب والرموز الغامضة أو تقديم القرابين لاسترضاء الأرواح، ولكن الكثير من هذه الممارسات يكتنفها الغموض ولا يمكن التحقق منها. رغم انتشار الأساطير حول السحر الأسود، لا يوجد دليل علمي يثبت وجوده أو تأثيره الحقيقي، حيث يرى العلماء أن تأثيره قد يكون ناتجًا عن الإيحاء النفسي الذي يمكن أن يؤدي إلى أعراض مرضية بسبب القلق والخوف. في الأدب والثقافة الشعبية، كان السحر الأسود مصدر إلهام للعديد من القصص والأفلام مثل ماكبث لشكسبير وهاري بوتر، حيث يظهر كقوة مظلمة مليئة بالغموض تعكس الفضول البشري والخوف من المجهول. يظل السحر الأسود موضوعًا مليئًا بالتناقضات؛ بالنسبة للبعض، هو مجرد خرافة أو وسيلة للسيطرة الاجتماعية، بينما يراه آخرون حقيقة تؤثر على حياتهم، مما يعكس رغبة الإنسان المستمرة في فهم القوى الخفية التي تحيط به.",
        "Summary": "يستعرض النص السحر الأسود كظاهرة تاريخية وثقافية، مع التركيز على جذوره في الحضارات القديمة، ارتباطه بالخوف من الشيطان، ودوره في المعتقدات الشعبية. يناقش النص تأثير السحر الأسود في الأدب والثقافة، مع الإشارة إلى عدم وجود دليل علمي يثبت وجوده الفعلي.",
        "Category": "Long",
        "Topic": "السحر الأسود بين الأسطورة والواقع",
        "Split": "Train"
    },
    {
        "ID": 54,
        "Document": "يوتيوب، الذي أُطلق في عام 2005، أصبح اليوم أكبر منصة لمشاركة الفيديوهات على الإنترنت، حيث يوفر محتوى متنوعًا يناسب جميع الاهتمامات، من التعليم والترفيه إلى الأخبار والموسيقى. تتيح المنصة للمستخدمين تحميل مقاطع الفيديو ومشاركتها مع جمهور عالمي، مما أدى إلى ظهور جيل جديد من المبدعين يُعرفون بـاليوتيوبرز الذين يمكنهم تحقيق أرباح من خلال الإعلانات والشراكات، مما جعل يوتيوب مصدر دخل رئيسي للعديد. إلى جانب الترفيه، يعد يوتيوب أداة تعليمية قوية تقدم محتوى مجانيًا في مجالات مثل الرياضيات، البرمجة، واللغات، بالإضافة إلى محتوى إبداعي يساعد المستخدمين على تطوير مهارات جديدة أو استكشاف اهتمامات متنوعة، من دروس الطبخ إلى الإرشادات التكنولوجية والعروض الثقافية. رغم ذلك، تواجه المنصة تحديات مثل الرقابة على المحتوى ومكافحة المعلومات المضللة التي تسعى لمعالجتها عبر تحسين الخوارزميات وأدوات الإبلاغ. كما يعاني بعض صناع المحتوى من سياسات الإعلانات التي تؤثر على دخلهم. يُستخدم يوتيوب أيضًا للترويج للأعمال التجارية والمبادرات الاجتماعية، حيث تعتمد الشركات على المنصة للتواصل مع جمهورها من خلال الإعلانات والمقاطع الترويجية، إضافة إلى تعزيز القضايا الاجتماعية والإنسانية، مما يجعلها أداة متعددة الأوجه تُحدث تأثيرًا عالميًا.",
        "Summary": "يوتيوب منصة تجمع بين الترفيه والتعليم، توفر فرصًا للمبدعين لتحقيق دخل وتدعم التواصل العالمي، مع تحديات مستمرة في ضبط المحتوى وضمان أمان المستخدمين.",
        "Category": "Medium",
        "Topic": "يوتيوب منصة الإعلام الرقمي الأولى",
        "Split": "Train"
    },
    {
        "ID": 29,
        "Document": "علم الأحياء هو دراسة الحياة بكل تنوعها وتعقيدها، حيث يتناول دراسة الكائنات الحية من أصغر الخلايا إلى أكبر الكائنات مثل الحيتان الزرقاء. لا يقتصر علم الأحياء على كونه مجالًا أكاديميًا، بل يمثل أساسًا لفهم العالم الطبيعي وكيفية تفاعله. أحد أهم فروعه هو علم الوراثة الذي يدرس الحمض النووي ويكشف أسرار تطور الكائنات الحية، ومن خلاله تمكن العلماء من تطوير تقنيات مثل الهندسة الوراثية التي تُستخدم اليوم في تحسين المحاصيل الزراعية وعلاج الأمراض الوراثية. بالإضافة إلى ذلك، تسهم دراسة البيئات الطبيعية في فهم التنوع البيولوجي وأهمية الحفاظ عليه. علم الأحياء له تطبيقات عملية واسعة تشمل الطب، حيث يُستخدم لفهم الأمراض وتطوير العلاجات، والزراعة، حيث يساهم في تحسين الإنتاج الغذائي بطريقة مستدامة، وحتى التكنولوجيا التي استلهمت من علم الأحياء لتطوير تقنيات تعتمد على محاكاة الطبيعة مثل الروبوتات التي تحاكي حركة الحيوانات. إن فهم الحياة لا يقتصر على الكائنات الحية فقط، بل يشمل البيئة التي تعيش فيها، حيث تمثل تفاعلات الكائنات مع بيئتها نظامًا متكاملًا يساعد على الحفاظ على توازن الكوكب. علم الأحياء يذكرنا بأهمية العيش بتناغم مع الطبيعة لضمان مستقبل مستدام.",
        "Summary": "يتناول النص علم الأحياء ودوره في فهم الحياة وتنوعها، مع التركيز على تطبيقاته في الطب والزراعة والتكنولوجيا، وأهمية الحفاظ على التنوع البيولوجي.",
        "Category": "Medium",
        "Topic": "علم الأحياء وفهم الحياة",
        "Split": "Train"
    },
    {
        "ID": 38,
        "Document": "فلسطين، أرض الأنبياء والتاريخ العريق، تُعد واحدة من أقدم المناطق المأهولة بالسكان في العالم، بموقعها الجغرافي الذي يربط بين آسيا وإفريقيا وأوروبا، مما جعلها ملتقى للحضارات والثقافات. منذ الكنعانيين الذين أسسوا أريحا، أقدم مدينة مأهولة، مرورًا بالحضارات المتعاقبة كالفراعنة والبابليين والرومان، أصبحت فلسطين مركزًا دينيًا للمسيحيين والمسلمين واليهود، خاصة في القدس، عاصمة فلسطين الأبدية، التي تضم المسجد الأقصى وقبة الصخرة وكنيسة القيامة. رغم هذا التراث، شهدت فلسطين قرونًا من الاحتلالات، مع تفاقم المأساة بعد وعد بلفور 1917 وإعلان قيام دولة إسرائيل عام 1948، الذي أدى إلى نكبة وتهجير مئات الآلاف. الفلسطينيون خاضوا نضالًا مستمرًا من الانتفاضات إلى الكفاح المسلح، وغزة باتت رمزًا للمقاومة رغم الحصار. القضية الفلسطينية قضية عالمية مدعومة بقرارات مثل قرار 194 حول حق العودة، لكن الاحتلال الإسرائيلي يستمر في انتهاك القوانين الدولية. الهوية الفلسطينية متجذرة في التراث الشعبي كالدبكة والمأكولات مثل المسخن والكنافة، والأدب الذي برز فيه غسان كنفاني ومحمود درويش يعبر عن المعاناة والآمال. رغم التحديات، يحمل الشباب الفلسطيني الأمل في بناء مستقبل أفضل من خلال التعليم والابتكار، مما يعكس صمود الشعب الفلسطيني وإيمانه بحقه في الحياة والحرية.",
        "Summary": "يستعرض النص تاريخ فلسطين العريق، من الكنعانيين إلى يومنا الحالي، مع التركيز على القدس كمركز ديني عالمي. يناقش النكبة والمقاومة الفلسطينية، مع تسليط الضوء على الهوية الثقافية والتراث الفلسطيني، والتحديات التي تواجه الشعب الفلسطيني في سعيه للحرية.",
        "Category": "Long",
        "Topic": "فلسطين أرض التاريخ والصمود",
        "Split": "Train"
    },
    {
        "ID": 148,
        "Document": " الألوفيرا، أو الصبار، هو نبات معروف بفوائده الصحية والجمالية. يحتوي على أوراق سميكة مليئة بجل غني بالمغذيات، مثل الفيتامينات والمعادن والأحماض الأمينية. يُستخدم جل الألوفيرا في العناية بالبشرة لترطيبها وتخفيف التهابات الجلد وحروق الشمس. كما يساعد في تهدئة الحكة وتسريع شفاء الجروح. علاوة على ذلك، يُعتبر الألوفيرا مكوناً شائعاً في منتجات الشعر، حيث يساهم في تحسين صحة فروة الرأس وتعزيز نمو الشعر. الاستخدام الداخلي للألوفيرا، من خلال العصائر، يساعد في تحسين الهضم وتقوية الجهاز المناعي. الألوفيرا نبات سهل الزراعة ويمكن الاحتفاظ به في المنازل للاستفادة منه بشكل يومي.",
        "Summary": "الألوفيرا نبات متعدد الاستخدامات يُستخدم لتحسين صحة الجلد والشعر والهضم، ويتميز بخصائص علاجية مذهلة",
        "Category": "Long",
        "Topic": "Aloe vera",
        "Split": "Train"
    },
    {
        "ID": 82,
        "Document": "حساسية الكلاب تحدث عندما يتفاعل الجهاز المناعي للبشر مع بروتينات موجودة في وبر الكلاب، لعابها، أو جلدها الميت، مما يؤدي إلى أعراض مثل العطس، سيلان الأنف، الحكة، وضيق التنفس، خاصة عند المصابين بالربو. تتطلب إدارة هذه الحالة تجنب التعرض المباشر للكلاب، استخدام مضادات الهيستامين، تنظيف المنزل بانتظام لتقليل الوبر، وتهيئة بيئة نظيفة باستخدام أجهزة تنقية الهواء، مع إمكانية اختيار سلالات تنتج وبرًا أقل لمن يعانون من حساسية خفيفة ويرغبون في الاحتفاظ بكلب.",
        "Summary": "حساسية الكلاب قد تكون مزعجة لكنها قابلة للإدارة من خلال العناية الطبية والإجراءات الوقائية المناسبة. فهم الأسباب، مثل التفاعل مع بروتينات وبر الكلاب أو لعابها، واتخاذ تدابير مثل تنظيف المنزل بانتظام واستخدام أجهزة تنقية الهواء، يُساعد على تقليل الأعراض والتعايش مع الكلاب دون التأثير السلبي على الصحة.",
        "Category": "Medium",
        "Topic": "حساسية الكلاب الأسباب والأعراض والعلاج",
        "Split": "Train"
    },
    {
        "ID": 69,
        "Document": "مقتل يوليوس قيصر في 15 مارس عام 44 قبل الميلاد، المعروف بإيديس مارس، يعد من أبرز الأحداث في التاريخ الروماني، حيث أنهى حياة قائد عسكري وسياسي بارز وأدى إلى سلسلة من التحولات التي غيرت مسار الإمبراطورية الرومانية. كان قيصر قائدًا طموحًا حقق نجاحات عسكرية كبيرة، منها غزو بلاد الغال وتوسيع حدود الإمبراطورية، وعاد إلى روما كبطل، لكن نفوذه المتزايد وإعلانه ديكتاتورًا مدى الحياة في 44 قبل الميلاد أثار قلق النخب السياسية التي رأت في طموحه تهديدًا للجمهورية الرومانية القائمة على توازن القوى. قرر مجموعة من أعضاء مجلس الشيوخ، بقيادة كاسيوس وبروتوس، التخلص منه لإنقاذ الجمهورية، وخططوا لاغتياله أثناء اجتماع مجلس الشيوخ. في يوم 15 مارس، دخل قيصر مجلس الشيوخ غير مدرك للمؤامرة، حيث أحاط به المتآمرون وطعنوه 23 مرة، ويقال إنه عندما رأى بروتوس بين المتآمرين قال كلمته الشهيرة حتى أنت يا بروتوس. لكن اغتياله لم يجلب الاستقرار الذي كان المتآمرون يأملون فيه، بل أدى إلى مزيد من الفوضى والحروب الأهلية، حيث شن أنصاره، مثل مارك أنطوني وأوكتافيان، حربًا ضد المتآمرين، مما أدى في النهاية إلى انهيار الجمهورية وتأسيس الإمبراطورية الرومانية تحت حكم أوكتافيان الذي أصبح الإمبراطور أغسطس. مقتل قيصر ترك أثرًا عميقًا على التاريخ الروماني والعالمي، وأصبح رمزًا للقوة والطموح، حيث ألهمت قصته العديد من الأعمال الأدبية والفنية، مثل مسرحية شكسبير يوليوس قيصر، ليظل إرثه شاهدًا على تعقيد السياسة وصراعات السلطة في روما القديمة.",
        "Summary": "مقتل يوليوس قيصر كان لحظة محورية في التاريخ الروماني، أنهى حياته وأطلق سلسلة من الأحداث التي حولت الجمهورية إلى إمبراطورية. يمثل هذا الحدث درسًا في الطموح السياسي وصراعات السلطة",
        "Category": "Long",
        "Topic": "مقتل يوليوس قيصر حدث غيّر مسار التاريخ الروماني",
        "Split": "Train"
    },
    {
        "ID": 7,
        "Document": "الذكاء الاصطناعي هو الثورة الجديدة التي تُغير العالم. هذه التقنية تُتيح للآلات محاكاة الذكاء البشري، مما يُمكنها من تحليل البيانات الضخمة واتخاذ قرارات معقدة بسرعة. يُستخدم الذكاء الاصطناعي في مجالات مثل الطب لتحليل الصور وتشخيص الأمراض، وفي التعليم لتوفير حلول تعليمية مخصصة. في الصناعة، تُساهم الروبوتات الذكية في تحسين الإنتاجية. ومع ذلك، هناك مخاوف بشأن تأثير الذكاء الاصطناعي على سوق العمل، حيث يُمكن أن تُصبح العديد من الوظائف مُهددة. لهذا السبب، يجب تحقيق التوازن بين التطور التكنولوجي وحماية حقوق الإنسان لضمان استفادة الجميع من هذه التقنية.",
        "Summary": "الذكاء الاصطناعي يُحدث ثورة في مجالات متعددة، لكنه يُثير مخاوف أخلاقية.",
        "Category": "Medium",
        "Topic": "الذكاء الاصطناعي",
        "Split": "Train"
    },
    {
        "ID": 106,
        "Document": "تشير الدراسات إلى أن الاستماع للموسيقى أثناء العمل يمكن أن يزيد من التركيز والإنتاجية، خاصة إذا كانت الموسيقى هادئة وغير مشتتة. في الوقت نفسه، بعض الأعمال تتطلب الهدوء التام، مما يجعل الموسيقى غير مناسبة لها",
        "Summary": "الموسيقى قد تعزز الإنتاجية إذا كانت مناسبة لنوع العمل، لكنها قد تكون مشتتة في بعض الحالات.",
        "Category": "Short",
        "Topic": "Music",
        "Split": "Test"
    },
    {
        "ID": 34,
        "Document": "الأسد، المعروف بملك الغابة، هو واحد من أكثر الحيوانات شهرة وقوة في العالم، يعيش في السافانا والغابات المفتوحة ويمتلك نظامًا اجتماعيًا فريدًا وحياة مليئة بالتحديات والمغامرات، مما يجعله رمزًا للشجاعة والقوة. تبدأ حياة الأسد عندما يولد داخل الزمرة، وهي وحدة اجتماعية تتألف عادةً من أسد ذكر رئيسي، وعدة لبؤات، وأشبالها، حيث تلعب اللبؤات دورًا محوريًا في تربية الأشبال وحمايتها، وتعمل الأمهات معًا لتوفير الغذاء والرعاية للصغار حتى تصبح قادرة على الاعتماد على نفسها. في سنواته الأولى، يتعلم الشبل مهارات البقاء من خلال اللعب مع أشقائه ومراقبة الكبار في الصيد، حيث تُعتبر هذه المهارة من أهم ما يجب أن يكتسبه الأسد للبقاء على قيد الحياة، وتقوم اللبؤات بدور الصيادات الرئيسيات في الزمرة، يعملن بشكل جماعي لصيد الفرائس مثل الحمار الوحشي والغزلان، مما يُظهر قوة الوحدة والتنظيم. مع بلوغ الأسد الشاب سن النضج، يُجبر عادةً على مغادرة الزمرة ليبدأ رحلة البحث عن زمرته الخاصة أو تحدي ذكر آخر للسيطرة على زمرة جديدة، وهي مرحلة مليئة بالمخاطر حيث يمكن أن يتعرض للإصابة أو الموت أثناء القتال. الذكر المسيطر في الزمرة يتمتع بمكانة خاصة، حيث يحصل على حق التزاوج مع اللبؤات ويضمن استمرار نسله، بالإضافة إلى دوره في حماية الزمرة من التهديدات الخارجية مثل الأسود الأخرى أو الحيوانات المفترسة، ويُعد زئير الأسد القوي وسيلة فعّالة للتواصل والإعلان عن وجوده في المنطقة. حياة الأسد ليست سهلة، إذ يواجه منافسة شرسة على الغذاء والماء، خصوصًا في فترات الجفاف، كما أن الصيد ليس دائمًا ناجحًا حيث تفشل الأسود في حوالي نصف محاولاتها، فضلًا عن المخاطر التي تواجه الأشبال من الحيوانات المفترسة مثل الضباع. مع تقدم الأسد في العمر، تبدأ قوته في التراجع، وغالبًا ما يُطرد الذكور الأكبر سنًا من الزمرة بواسطة ذكور أصغر وأكثر قوة، مما يضطرهم إلى العيش بمفردهم أو الانضمام إلى مجموعات صغيرة من الذكور، وهي مرحلة صعبة لكنها جزء طبيعي من دورة حياة الأسد. الأسود تلعب دورًا حيويًا في الحفاظ على توازن النظام البيئي، إذ تساهم في تقوية صحة مجموعات الحيوانات الأخرى من خلال افتراس الحيوانات الضعيفة أو المريضة، ومع ذلك تواجه تهديدات كبيرة من النشاط البشري مثل الصيد الجائر وفقدان الموائل الطبيعية، مما يضعها على قائمة الأنواع المهددة بالانقراض. إن حياة الأسد تمثل مزيجًا من القوة والصراع والبقاء، ومن لحظة ولادته حتى شيخوخته يواجه الأسد تحديات لا تنتهي، لكنه يظل رمزًا للشجاعة والقيادة في عالم الحيوانات، والحفاظ عليه مسؤولية بشرية لضمان استمرار هذا المخلوق الرائع في الوجود.",
        "Summary": "يستعرض النص حياة الأسد من ولادته في الزمرة، حيث يتعلم الصيد والبقاء، إلى دوره كذكر مسيطر يحمي الزمرة. يركز على تحدياته كالمنافسة على الغذاء والمخاطر البيئية، ويبرز أهميته في توازن النظام البيئي وضرورة حمايته من التهديدات.",
        "Category": "Long",
        "Topic": "حياة الأسد في الغابة",
        "Split": "Train"
    },
    {
        "ID": 44,
        "Document": "الجاذبية هي واحدة من أهم الظواهر الطبيعية التي تشكل أساس فهمنا للكون، حيث لاحظ الإنسان منذ العصور القديمة أن الأشياء تسقط دائمًا نحو الأرض، لكن تفسير هذه الظاهرة لم يتضح حتى قدم السير إسحاق نيوتن نظريته في القرن السابع عشر، والتي عرّفت الجاذبية كقوة تجذب بها الأجسام بعضها البعض وتعتمد على كتل الأجسام والمسافة بينها. نظرية نيوتن، التي نُشرت في كتابه الأصول الرياضية للفلسفة الطبيعية عام 1687، وضعت الأساس لفهم حركة الكواكب في النظام الشمسي وتفسير ظواهر مثل المد والجزر. ومع ذلك، لم تكن كافية لتفسير جميع الظواهر، حتى قدم ألبرت أينشتاين نظريته النسبية العامة في أوائل القرن العشرين، معيدًا تعريف الجاذبية كتشوه في نسيج الزمكان بفعل الأجسام ذات الكتلة الكبيرة مثل الشمس، مما يفسر مسارات الأجسام الأصغر حولها، وأثبتت هذه النظرية صحتها عند مراقبة انحناء ضوء النجوم أثناء كسوف الشمس عام 1919. الجاذبية ليست مجرد قوة تؤثر على سقوط الأشياء، بل هي القوة التي تحكم حركة الكون، من بقاء الكواكب في مداراتها إلى تشكيل النجوم وحركة المجرات، كما أنها تحافظ على الغلاف الجوي والمياه الضرورية للحياة على الأرض. رغم التقدم في فهم الجاذبية، لا تزال هناك أسئلة غامضة، مثل دمج الجاذبية مع القوى الأساسية الأخرى في نظرية كل شيء وفهم طبيعتها على مستوى الجسيمات الصغيرة جدًا ضمن ميكانيكا الكم. الأبحاث الحديثة تركز على تأثيرات الجاذبية في الظروف القصوى مثل الثقوب السوداء، التي تتحدى قوانين الفيزياء التقليدية، حيث فتحت موجات الجاذبية، المكتشفة عام 2015، نافذة جديدة لدراسة هذه الظاهرة من خلال تموجات الزمكان الناتجة عن أحداث كونية ضخمة. الجاذبية ليست فقط مفهوماً علمياً بل هي جزء من حياتنا اليومية، حيث تجعلنا نشعر بالوزن وتؤثر على تصميم المباني والجسور وتحدد المسارات الفضائية. من نيوتن إلى أينشتاين، ساهمت الدراسات حول الجاذبية في توسيع معرفتنا، ومع استمرار التقدم العلمي، سيظل فهمنا لهذه القوة الأساسية يتطور، مما قد يكشف عن أسرار جديدة للكون الذي نعيش فيه.",
        "Summary": "يتناول النص تطور نظرية الجاذبية من نيوتن، كقوة جذب بين الأجسام، إلى أينشتاين، كتشوه في نسيج الزمكان، ودورها في حركة الكون. كما يناقش تحديات فهمها ضمن ميكانيكا الكم وأهميتها في التطبيقات اليومية واستكشاف الفضاء.",
        "Category": "Long",
        "Topic": "نظرية الجاذبية قوة الطبيعة الغامضة",
        "Split": "Train"
    },
    {
        "ID": 93,
        "Document": "إمينيم، واسمه الحقيقي مارشال بروس ماذرز الثالث، هو أحد أبرز فناني الهيب هوب في العالم، وُلد في 17 أكتوبر 1972 في سانت جوزيف، ميزوري، ونشأ في ظروف صعبة في أحياء فقيرة في ديترويت. واجه صعوبات عديدة من بينها الفقر، التنمر بسبب بشرته البيضاء في مجتمع يغلب عليه الأمريكيون من أصول إفريقية، وعلاقة مضطربة مع والدته، مما أثر على شخصيته وألهم مسيرته الفنية. لجأ إلى الراب كوسيلة للتعبير عن مشاعره، وبدأ في أندية الراب في ديترويت، حيث أظهر موهبة استثنائية في تأليف الكلمات وأداء الراب بأسلوب سريع ومميز. بعد إخفاق ألبومه الأول في عام 1996، لم يستسلم، وكان اكتشافه من قبل دكتور دري نقطة تحول في حياته المهنية. أصدر ألبومه الثاني عام 1999، الذي حقق نجاحًا هائلًا وفاز بجائزة غرامي، وتبعه بألبومات ناجحة أخرى رسخت مكانته كأحد أعظم فناني الراب. تناولت أغانيه مواضيع شخصية مثل علاقته بزوجته السابقة كيم سكوت وابنته هايلي، مما أكسبه محبة الجمهور وأثار الجدل بسبب جرأته. عانى من مشاكل الإدمان على المخدرات لكنه تعافى بعد برنامج إعادة تأهيل في 2007، وعاد بقوة مع ألبوم في 2009. حصل على العديد من الجوائز بما في ذلك 15 جائزة غرامي وجائزة أوسكار عن أغنيته، ليصبح رمزًا للإصرار والتغلب على الصعوبات وأحد أكثر الفنانين تأثيرًا في العالم.",
        "Summary": "حياة إمينيم تجسد قصة نجاح ملهمة عن التحدي والإصرار، حيث تمكن من التحول من طفل نشأ في فقر وصعوبات نفسية إلى نجم عالمي في عالم الموسيقى، مما يثبت أن الموهبة والعمل الجاد يمكنهما تحقيق المستحيل.",
        "Category": "Long",
        "Topic": "حياة إمينيم قصة الصعود من الصعوبات إلى النجومية",
        "Split": "Test"
    },
    {
        "ID": 151,
        "Document": "البيتزا هي واحدة من أشهر الأطعمة في العالم، وتتميز بتنوع مكوناتها. يُمكن تخصيصها لتناسب جميع الأذواق، من البيتزا الكلاسيكية بالجبن والطماطم إلى الأنواع الأكثر جرأة مثل بيتزا المأكولات البحرية. تُعتبر وجبة مثالية للمناسبات المختلفة.",
        "Summary": "البيتزا طعام عالمي مفضل يتميز بتنوع النكهات والمكونات، مما يجعله مناسباً لجميع الأذواق.",
        "Category": "Short",
        "Topic": "Pizza",
        "Split": "Train"
    },
    {
        "ID": 73,
        "Document": "قانون الانعكاس يصف كيفية انعكاس الضوء عند اصطدامه بسطح أملس، حيث تنص القاعدة على أن زاوية السقوط تساوي زاوية الانعكاس، وتقاس الزاويتان بالنسبة إلى العمود العمودي على السطح. هذا القانون أساس لفهم الظواهر البصرية ويُستخدم في تصميم المرايا والتلسكوبات والألياف البصرية التي تنقل الإشارات عبر مسافات طويلة بكفاءة، كما تعتمد عليه الكاميرات والأدوات البصرية. يفسر القانون ظواهر يومية مثل رؤية الصور في الماء أو الزجاج، وتُستخدم مفاهيمه في التطبيقات العلمية والفنية مثل التصوير الفوتوغرافي.",
        "Summary": "قانون الانعكاس يصف انعكاس الضوء وله تطبيقات واسعة في تصميم الأجهزة البصرية والاتصالات باستخدام الألياف البصرية.",
        "Category": "Short",
        "Topic": "قانون الانعكاس",
        "Split": "Validation"
    },
    {
        "ID": 92,
        "Document": "المغرب، الواقع في شمال غرب إفريقيا، هو دولة ذات تاريخ عريق وثقافة متنوعة وموقع استراتيجي يجعله واحدًا من أهم الدول في المنطقة، حيث كان منذ العصور القديمة ملتقى للعديد من الحضارات مثل الأمازيغية والرومانية والإسلامية التي تركت أثرًا عميقًا في تراثه الثقافي الذي تعكسه مدن مثل فاس ومراكش والرباط بمعالمها وأسواقها التقليدية. تتميز الثقافة المغربية بتنوعها الذي يمزج بين التأثيرات الأمازيغية والعربية والإفريقية مع لمسات أوروبية، وهو ما يظهر في الفنون والموسيقى والمطبخ الذي يشتهر بأطباق مثل الكسكس والطاجين، بينما تجذب المهرجانات مثل مهرجان موازين ومهرجان كناوة زوارًا من جميع أنحاء العالم. يتمتع المغرب باقتصاد متنوع يعتمد على الزراعة والصناعة والخدمات، حيث يُصدر الفوسفات والزيتون والحمضيات ويشهد نموًا ملحوظًا في صناعات السيارات والطيران، في حين تلعب السياحة دورًا حيويًا بفضل مدنه التاريخية ومناظره الطبيعية الخلابة وبنيته التحتية المتطورة مثل مطار محمد الخامس والطرق السريعة. سياسيًا، يتمتع المغرب باستقرار نسبي مع نظام ملكي يسهم في الحفاظ على التوازن السياسي ويعمل على تعزيز التعاون الإقليمي والدولي، خاصة مع إفريقيا وأوروبا، ويُعد نموذجًا في مجال الطاقة المتجددة بمشاريع مثل محطة نور ورزازات للطاقة الشمسية. ومع ذلك، يواجه المغرب تحديات تشمل البطالة والفقر والتفاوت الإقليمي بين المدن الكبرى والمناطق الريفية، إلا أن الإصلاحات الاقتصادية والاجتماعية التي يتبناها تبشر بمستقبل واعد.",
        "Summary": "المغرب يجمع بين التاريخ الغني، الثقافة المتنوعة، والاقتصاد المزدهر، مما يجعله قوة مؤثرة في المنطقة. بموقعه الاستراتيجي الذي يربط بين إفريقيا وأوروبا، وتراثه العريق الذي يعكس الحضارات الأمازيغية والإسلامية والرومانية، إلى جانب استثماراته في قطاعات حيوية كالسياحة والطاقة المتجددة، يُثبت المغرب أنه دولة تجمع بين الأصالة والحداثة لتحقيق التنمية المستدامة وبناء مستقبل واعد لشعبه.",
        "Category": "Long",
        "Topic": "قوة المغرب مزيج من التاريخ والثقافة والاقتصاد",
        "Split": "Test"
    },
    {
        "ID": 88,
        "Document": "كرة القدم تُعتبر الرياضة الأكثر شعبية حول العالم، حيث تجذب ملايين المشجعين من مختلف الثقافات والجنسيات. تُلعب هذه الرياضة على ملعب مستطيل الشكل بين فريقين، وكل فريق يسعى لتسجيل الأهداف في مرمى الفريق الآخر. تاريخ كرة القدم يعود إلى العصور القديمة، حيث كانت هناك ألعاب مشابهة تُمارس في الصين واليونان، لكن الشكل الحديث للعبة تم تطويره في إنجلترا خلال القرن التاسع عشر، ومنذ ذلك الحين أصبحت كرة القدم ظاهرة عالمية. البطولات العالمية مثل كأس العالم، التي تُنظم كل أربع سنوات، تُعتبر من أبرز الأحداث الرياضية، حيث تجمع بين أفضل الفرق الوطنية وتُشعل حماس الملايين. بالإضافة إلى ذلك، توجد بطولات إقليمية ومحلية مثل دوري أبطال أوروبا، الذي يُعد منصة تنافسية بين أفضل الأندية. تأثير كرة القدم يتجاوز الملعب، حيث تُعزز الوحدة بين الناس وتُساهم في نشر قيم الرياضة مثل الروح الرياضية والعمل الجماعي. كما أن اللاعبين البارزين مثل ليونيل ميسي وكريستيانو رونالدو أصبحوا أيقونات عالمية، يعكسون شغف الملايين بهذه الرياضة ويستمرون في إلهام الأجيال الجديدة.",
        "Summary": "كرة القدم هي الرياضة الأكثر شعبية عالميًا، تجمع بين الإثارة والتنافس، وتُعتبر وسيلة لتعزيز الوحدة والقيم الرياضية من خلال شغف مشترك يوحد الجماهير واللاعبين عبر الثقافات والحدود.",
        "Category": "Short",
        "Topic": "كرة القدم الرياضة الأكثر شعبية في العالم",
        "Split": "Train"
    },
    {
        "ID": 68,
        "Document": "الكيبوب، نوع الموسيقى الكورية الجنوبية، أصبح ظاهرة عالمية خلال العقد الأخير، ولم يكن الشرق الأوسط بمنأى عن هذا التأثير، حيث تمكنت فرق الكيبوب بفضل الإنترنت ووسائل التواصل الاجتماعي من الوصول إلى ملايين المعجبين في المنطقة، مما جعله جزءًا من حياة الشباب العربي. أحد أبرز تأثيراته هو تعزيز التبادل الثقافي، حيث فتحت الأغاني الكورية والمحتوى المرتبط بها الباب أمام الشباب العربي للتعرف على اللغة والثقافة الكورية، مما دفع الكثيرين إلى تعلم اللغة ومتابعة الدراما الكورية لتعميق فهمهم لهذه الثقافة. الكيبوب لم يقتصر على الموسيقى، بل أثر أيضًا على أسلوب الحياة، حيث أصبحت الموضة الكورية، مثل ملابس الآيدولز وتسريحات الشعر، مصدر إلهام للشباب العربي، مما يعكس قدرة الثقافة الشعبية على تجاوز الحدود الجغرافية. كما ساهم في تعزيز الروابط بين مجتمعات المعجبين الذين تشكلوا على منصات التواصل الاجتماعي مثل تويتر وإنستغرام، حيث يتبادلون الأخبار وينظمون فعاليات لدعم فرقهم المفضلة، ما جعلها مكانًا للتواصل والتفاعل بين الشباب من خلفيات مختلفة. رغم الانتقادات التي تُوجه للكيبوب أحيانًا بشأن تأثيره على الهوية الثقافية المحلية، يرى الكثيرون أن هذه الظاهرة تعزز انفتاح الشباب العربي على العالم، مع التحدي المتمثل في تحقيق التوازن بين الحفاظ على الهوية والانفتاح على ثقافات أخرى في عصر العولمة.",
        "Summary": "الكيبوب أثر بشكل كبير على الشباب في الشرق الأوسط، معززًا التبادل الثقافي ومؤثرًا في الموضة وأسلوب الحياة. رغم بعض التحديات، يظل الكيبوب رمزًا للانفتاح الثقافي والتواصل العالمي.",
        "Category": "Long",
        "Topic": "تأثير الكيبوب على الشرق الأوسط",
        "Split": "Train"
    },
    {
        "ID": 125,
        "Document": "شبكات الحاسوب هي مجموعة من الأنظمة المتصلة ببعضها لنقل البيانات وتبادل الموارد. تعمل هذه الشبكات باستخدام بروتوكولات محددة تضمن انتقال البيانات بشكل آمن ومنظم. تُقسم الشبكات إلى أنواع مثل الشبكة المحلية (LAN) والشبكة الواسعة (WAN)، وكل منها يلبي احتياجات مختلفة. تلعب شبكات الحاسوب دوراً حيوياً في الحياة الحديثة، حيث تُستخدم في الشركات، التعليم، وحتى المنازل. توفر الشبكات الوصول إلى الإنترنت، مما يجعلها وسيلة للتواصل والمشاركة العالمية. تتطلب إدارة الشبكات مهارات تقنية عالية لضمان الأمن والكفاءة. الأمن السيبراني هو أحد أهم الجوانب المتعلقة بالشبكات، حيث يعمل على حماية البيانات من التهديدات الإلكترونية. مع تطور التكنولوجيا، أصبحت شبكات الحاسوب أكثر تطوراً، حيث يتم دمجها مع الذكاء الاصطناعي وإنترنت الأشياء",
        "Summary": "شبكات الحاسوب تسهل نقل البيانات وتبادل الموارد، وهي أساس التواصل في العصر الرقمي.",
        "Category": "Long",
        "Topic": "computer networks",
        "Split": "Test"
    },
    {
        "ID": 61,
        "Document": "المنازل الكبيرة تعكس الفخامة والراحة، حيث توفر مساحات واسعة تلبي احتياجات السكان من خلال تصميمات مميزة تضم غرفًا متعددة وحدائق واسعة، مما يمنح شعورًا بالحرية والخصوصية. ومع ذلك، تواجه هذه المنازل تحديات مثل التكلفة العالية والصيانة المستمرة، إضافة إلى تأثيرها البيئي السلبي إذا لم تُصمم بكفاءة في استخدام الطاقة. رغم هذه التحديات، تبقى المنازل الكبيرة رمزًا للرغبة في تحقيق أسلوب حياة فاخر.",
        "Summary": "المنازل الكبيرة تعكس الفخامة والراحة، لكنها تأتي مع تحديات التكلفة والصيانة.",
        "Category": "Short",
        "Topic": "المنازل الكبيرة رمز الفخامة",
        "Split": "Train"
    },
    {
        "ID": 116,
        "Document": " سماعات الأذن أصبحت جزءاً أساسياً من حياتنا اليومية، حيث تتيح الاستماع للموسيقى والمكالمات بسهولة. تتميز بتصاميمها المدمجة التي تجعلها مريحة وسهلة الحمل. تتوفر بأشكال متنوعة مثل السلكية واللاسلكية، مما يلبي احتياجات المستخدمين المختلفة. توفر سماعات الأذن اللاسلكية حرية أكبر بفضل تقنيات البلوتوث المتطورة. تُستخدم في العديد من الأنشطة مثل التمارين الرياضية، العمل، أو حتى الاسترخاء. ومع التطور التكنولوجي، أصبحت توفر جودة صوت عالية وعزلًا ممتازًا للضوضاء.",
        "Summary": "سماعات الأذن تجمع بين الراحة والتقنية المتطورة، مما يجعلها أداة متعددة الاستخدامات للحياة اليومية.",
        "Category": "Medium",
        "Topic": "Earbuds",
        "Split": "Train"
    },
    {
        "ID": 124,
        "Document": " الأوردة هي جزء من الجهاز الدوري في الجسم، وتعمل على إعادة الدم من الأنسجة إلى القلب. تحتوي الأوردة على صمامات تمنع رجوع الدم في الاتجاه المعاكس، مما يضمن تدفقه بشكل منتظم. تختلف الأوردة عن الشرايين في بنائها، حيث تكون جدرانها أقل سمكاً وأكثر مرونة. تلعب الأوردة دوراً مهماً في الحفاظ على الدورة الدموية، وتساهم في التخلص من ثاني أكسيد الكربون والفضلات من الجسم. مشاكل الأوردة، مثل الدوالي، قد تؤثر على تدفق الدم وتسبب الألم. العناية بصحة الأوردة تتطلب الحركة المنتظمة وتجنب الجلوس لفترات طويلة.",
        "Summary": "الأوردة هي جزء حيوي من الدورة الدموية، تعمل على إعادة الدم إلى القلب، وتحتاج إلى عناية للحفاظ على وظيفتها.",
        "Category": "Long",
        "Topic": "veins",
        "Split": "Train"
    },
    {
        "ID": 32,
        "Document": "علم الأحياء البحرية هو العلم الذي يدرس الكائنات الحية في المحيطات والبيئات المائية، حيث يشكل المحيط أكثر من 70% من سطح الأرض ويعتبر موطنًا لعدد لا يحصى من الكائنات الحية. من الشعاب المرجانية إلى الحيتان العملاقة، يعكس هذا العالم البحري تنوعًا بيئيًا مذهلًا. أحد أبرز فروع علم الأحياء البحرية هو دراسة الشعاب المرجانية، التي تُعتبر غابات المحيط وتلعب دورًا حاسمًا في دعم الحياة البحرية وتنظيم المناخ، إلا أنها تواجه تهديدات كبيرة بسبب تغير المناخ والتلوث. علم الأحياء البحرية لا يقتصر فقط على دراسة الكائنات الحية، بل يشمل أيضًا دراسة التيارات المائية وتأثيرها على البيئة، وبفضل التقدم التكنولوجي تمكن العلماء من استكشاف أعماق المحيط باستخدام غواصات آلية ومعدات متطورة. تعد المحيطات مصدرًا رئيسيًا للموارد الغذائية، حيث يعتمد ملايين الأشخاص حول العالم على الصيد، كما أن الأبحاث البحرية تلعب دورًا في اكتشاف أدوية جديدة تستخرج من الكائنات البحرية. علم الأحياء البحرية يذكرنا بأهمية الحفاظ على المحيطات كجزء أساسي من توازن الكوكب.",
        "Summary": "يتناول النص علم الأحياء البحرية ودوره في فهم الكائنات البحرية والبيئات المائية، مع التركيز على أهمية الحفاظ على المحيطات واستكشاف مواردها.",
        "Category": "Short",
        "Topic": "علم الأحياء البحرية واستكشاف المحيطات",
        "Split": "Validation"
    },
    {
        "ID": 85,
        "Document": "العراب هو فيلم كلاسيكي من إخراج فرانسيس فورد كوبولا، صدر عام 1972 ويُعد أحد أعظم الأعمال السينمائية في التاريخ، مستندًا إلى رواية ماريو بوزو. يروي الفيلم قصة عائلة كورليوني، عائلة مافيا إيطالية أمريكية تصارع للحفاظ على سلطتها في عالم الجريمة المنظمة. تدور الأحداث حول دون فيتو كورليوني، زعيم العائلة الذي يحاول حماية نفوذه وسط صراعات مع عصابات أخرى، ومع مرور الوقت يتورط ابنه الأصغر مايكل، رغم رغبته في الابتعاد عن هذا العالم، ليصبح زعيمًا قويًا لا يرحم. يُبرز الفيلم موضوعات الشرف، الولاء، والفساد، مسلطًا الضوء على دور العائلة كمصدر قوة وضعف في آن واحد. يتميز الفيلم بأداء استثنائي من مارلون براندو في دور دون فيتو وآل باتشينو في دور مايكل، مع موسيقى تصويرية مميزة عززت تأثيره العميق، حيث تجاوز كونه فيلمًا عن الجريمة ليصبح دراسة عميقة للنفس البشرية وصراعاتها.",
        "Summary": "العراب هو فيلم كلاسيكي يتناول صراعات عائلة مافيا إيطالية أمريكية مع موضوعات الولاء والفساد، ويتميز بأداء استثنائي من مارلون براندو وآل باتشينو.",
        "Category": "Short",
        "Topic": "فيلم العراب",
        "Split": "Validation"
    },
    {
        "ID": 90,
        "Document": "العنصرية هي تمييز أو معاملة غير عادلة للأفراد أو الجماعات بناءً على العرق أو اللون أو الأصل، تُعد واحدة من أكثر المشكلات الاجتماعية والتاريخية تعقيدًا، حيث تؤثر على حياة الناس والمجتمعات بشكل كبير، وكانت سببًا في العديد من الصراعات والانقسامات التي أضرت بالنسيج الاجتماعي. أسباب العنصرية تشمل التحيز الثقافي، الجهل، والخوف من الآخر، حيث يُعد الجهل بالثقافات والأعراق المختلفة سببًا رئيسيًا في ظهور التحيزات العنصرية، كما تُساهم التربية الاجتماعية في نقل الأفكار العنصرية من جيل إلى آخر إذا لم تُواجه بالتعليم والتوعية. العنصرية تؤدي إلى آثار سلبية عميقة على الأفراد والمجتمعات، حيث قد يعاني الأفراد الذين يتعرضون للتمييز من انخفاض الثقة بالنفس والشعور بالعزلة، بينما تؤدي على المستوى الاجتماعي إلى انقسامات بين الجماعات وتُضعف التماسك الاجتماعي، وتُسهم في حرمان بعض الفئات من الفرص التعليمية والاقتصادية، مما يعزز الفقر وعدم المساواة. كما أن لها تأثيرات نفسية عميقة، إذ قد تؤدي إلى الاكتئاب والقلق، بينما تواجه المجتمعات العنصرية تحديات في بناء بيئة من السلام والاحترام المتبادل. مكافحة العنصرية تتطلب التركيز على التعليم والتوعية، حيث يلعب التعليم دورًا حاسمًا في تعريف الناس بأهمية التنوع الثقافي وكيفية تقديره، كما تُعد حملات التوعية التي تُبرز القصص الإيجابية للأفراد من مختلف الأعراق وسيلة فعالة لتغيير النظرة العنصرية. القوانين والسياسات المناهضة للتمييز تُعتبر أساسية في الحد من العنصرية، إذ يجب تطبيق قوانين صارمة ضد التمييز في مكان العمل والمدارس والمجتمعات، كما يمكن لمنصات التواصل الاجتماعي أن تُسهم في نشر الرسائل الإيجابية ومواجهة خطاب الكراهية لتعزيز قيم المساواة والاحترام.",
        "Summary": "العنصرية مشكلة عالمية تؤثر بعمق على الأفراد والمجتمعات، مسببة انقسامات اجتماعية وآثارًا نفسية واقتصادية سلبية، لكن من خلال التعليم الذي يُعزز الوعي بأهمية التنوع، التوعية التي تُبرز القصص الإيجابية للتنوع الثقافي، وتطبيق القوانين الصارمة لمكافحة التمييز، يمكن للمجتمعات الحد من العنصرية والعمل على بناء بيئة أكثر شمولية واحترامًا للجميع.",
        "Category": "Medium",
        "Topic": "العنصرية الأسباب والتأثيرات وكيفية مواجهتها",
        "Split": "Train"
    },
    {
        "ID": 35,
        "Document": "الكائنات الفضائية لطالما أثارت فضول البشرية وألهمت خيال العلماء والمبدعين، حيث تساءل الإنسان منذ العصور القديمة عن وجود حياة خارج كوكب الأرض. مع تطور العلم والتكنولوجيا، أصبح البحث عن الكائنات الفضائية جزءًا مهمًا من علوم الفضاء والفلك، سعيًا للإجابة على أحد أكثر الأسئلة إثارة: هل نحن وحدنا في الكون؟ الكون الشاسع يضم مليارات المجرات والنجوم والكواكب، مما يجعل احتمالية وجود حياة في مكان آخر منطقية، خصوصًا مع اكتشاف الكواكب الخارجية التي تحتوي على شروط مشابهة للأرض مثل الماء والغلاف الجوي المناسب. مشروع سيتي هو إحدى أكبر المبادرات العلمية التي تهدف إلى البحث عن إشارات راديوية قد تكون صادرة عن حضارات ذكية، وعلى الرغم من الجهود المستمرة لم يُكتشف دليل قاطع حتى الآن، لكن التلسكوبات المتطورة مثل جيمس ويب تتيح مزيدًا من الاستكشاف. بالإضافة إلى ذلك، أثارت تقارير عديدة عن رؤية أطباق طائرة وكائنات غريبة جدلًا واسعًا، مثل حادثة روزويل الشهيرة عام 1947 التي عززت نظريات وجود الكائنات الفضائية رغم الغموض المحيط بها. الأفلام والكتب ساهمت بدورها في تشكيل تصوراتنا عن الكائنات الفضائية، حيث قدمت بعضها ككائنات سلمية ومتقدمة بينما صورتها أخرى كغزاة تسعى للسيطرة على الأرض. الأبحاث الحديثة أظهرت أن البحث عن الكائنات الفضائية ليس خيالًا علميًا فقط، بل مجال علمي حقيقي، مع اكتشاف كواكب قد تكون صالحة للحياة مثل بروكسيما بي الذي يبعد 4.2 سنوات ضوئية. رغم ذلك، تواجه هذه الجهود تحديات كبيرة بسبب المسافات الهائلة بين النجوم والكواكب وصعوبة التواصل أو السفر إليها، مما يجعل هذا البحث عملية طويلة الأمد تتطلب صبرًا وتطورًا تقنيًا كبيرًا. إذا تم اكتشاف كائنات فضائية بالفعل، فإن ذلك سيغير مفهومنا عن مكانتنا في الكون وقد يفتح أبوابًا للتعاون وتبادل المعرفة، لكنه قد يثير أيضًا تحديات أخلاقية وسياسية حول كيفية التعامل مع حضارات قد تكون متقدمة علينا بآلاف السنين. الكائنات الفضائية تظل واحدة من أكبر ألغاز الكون، والبحث عنها يعكس رغبة الإنسان في استكشاف المجهول وفهم موقعه في هذا الكون الواسع، ومع تقدم التكنولوجيا قد يكون المستقبل مليئًا بالمفاجآت.",
        "Summary": "يتناول النص موضوع الكائنات الفضائية واحتمالية وجود حياة خارج الأرض. يناقش البحث العلمي، مثل مشروع سيتي واكتشاف الكواكب الصالحة للحياة، بالإضافة إلى القصص الشعبية والأعمال الفنية التي تتناول الكائنات الفضائية. يركز النص على التحديات التي تواجه البحث وأثر هذا الاكتشاف على البشرية.",
        "Category": "Long",
        "Topic": "الكائنات الفضائية: أسطورة أم حقيقة؟",
        "Split": "Train"
    },
    {
        "ID": 23,
        "Document": "القاهرة، عاصمة مصر، مدينة لا تنام. هي المدينة التي تمتزج فيها العراقة بالتجدد، والهدوء بالضجيج. على ضفاف النيل الخالد، يقف التاريخ شاهدًا على الحضارة المصرية التي أضاءت العالم. في القاهرة، ترى الأهرامات شامخة في الجيزة، تطل على العالم بفخر وكبرياء. أهرامات خوفو وخفرع ومنقرع ليست مجرد أحجار، بل هي حكايات تحكي عن العظمة والصبر والإبداع. وعندما تسير في شوارع القاهرة القديمة، خاصة في خان الخليلي، تشعر وكأنك انتقلت إلى عالم آخر. المآذن العالية، وأسواق التوابل، وروائح القهوة العربية تجذبك لتغوص في تجربة تاريخية فريدة لا مثيل لها. ومن خان الخليلي إلى شارع المعز لدين الله، تجد نفسك محاطًا بجمال العمارة الإسلامية التي تعكس عبقرية الحرفيين عبر العصور. القاهرة ليست فقط ماضيًا، بل هي الحاضر والمستقبل أيضًا. برج القاهرة، الذي يقف شامخًا في جزيرة الزمالك، يمثل قدرة الإنسان المصري على التحدي والإبداع. ومن النيل، النهر الذي يسري في عروق المصريين، ترى المراكب النيلية تضفي رونقًا خاصًا على المدينة. ولا يمكن أن ننسى الأسماء الخالدة التي تألقت في سماء القاهرة، مثل الأديب نجيب محفوظ، الذي كتب عن المدينة وشوارعها في رواياته الخالدة، وأم كلثوم، كوكب الشرق، التي غنت للنيل ولروح المصريين. القاهرة ليست مجرد مكان، بل هي حالة من الشغف والجمال الذي لا ينتهي.",
        "Summary": "يتحدث النص عن جمال القاهرة، العاصمة المصرية، ومزجها بين التاريخ والحاضر. يستعرض المعالم الشهيرة كالأهرامات، خان الخليلي، وشارع المعز، مع إبراز أهمية النيل وبرج القاهرة. كما يُذكر شخصيات خالدة مثل نجيب محفوظ وأم كلثوم",
        "Category": "Long",
        "Topic": "جمال القاهرة",
        "Split": "Train"
    },
    {
        "ID": 126,
        "Document": " المشاعر جزء أساسي من تجربة الإنسان، وهي التي تضفي معنى على الحياة. تتنوع المشاعر بين الفرح، الحزن، الغضب، والحب، وكل منها يحمل تأثيراً على تصرفاتنا وعلاقاتنا. القدرة على فهم المشاعر والتعبير عنها تُعد مهارة أساسية للتواصل الفعال والحفاظ على الصحة النفسية",
        "Summary": "المشاعر تضفي عمقاً على تجربة الإنسان وتؤثر في تصرفاته وعلاقاته، مما يجعل فهمها ضرورياً للحياة المتوازنة.",
        "Category": "Short",
        "Topic": "feelings",
        "Split": "Train"
    },
    {
        "ID": 22,
        "Document": "الملك آرثر فيلم تاريخي يروي قصة الملك آرثر وفرسان الطاولة المستديرة. يُركز الفيلم على صراع آرثر لحماية مملكته من الغزاة، بينما يبحث عن السيف الأسطوري إكسكاليبر. يعكس الفيلم قيم الشجاعة والولاء والتضحية، مع تصوير ملحمي للمعارك.",
        "Summary": "الملك آرثر فيلم تاريخي يروي قصة الملك آرثر وفرسانه في صراع لحماية مملكته والبحث عن السيف الأسطوري.",
        "Category": "Short",
        "Topic": "الملك آرثر",
        "Split": "Train"
    },
    {
        "ID": 108,
        "Document": "تعليم الموسيقى للأطفال يُساهم في تطوير مهاراتهم الإدراكية والاجتماعية. العزف على الآلات الموسيقية يُحسن من التنسيق بين اليد والعين، بينما يساعد الغناء في تحسين النطق وتطوير المهارات اللغوية.",
        "Summary": "تعليم الموسيقى للأطفال يعزز النمو الإدراكي والاجتماعي ويساعد في تطوير المهارات الحركية واللغوية.",
        "Category": "Short",
        "Topic": "Music",
        "Split": "Train"
    },
    {
        "ID": 144,
        "Document": "أدوية الصحة النفسية تُستخدم لعلاج اضطرابات مثل الاكتئاب، القلق، والذهان. تساعد هذه الأدوية في تحسين التوازن الكيميائي في الدماغ، مما يساهم في تخفيف الأعراض وتحسين جودة الحياة. يجب تناولها تحت إشراف طبي لضمان الفعالية وتجنب الآثار الجانبية",
        "Summary": "أدوية الصحة النفسية تُعالج اضطرابات مثل الاكتئاب والقلق، ويجب تناsولها تحت إشراف طبي.",
        "Category": "Short",
        "Topic": "mental health medication",
        "Split": "Train"
    },
    {
        "ID": 24,
        "Document": "الصحراء العربية، عالم من الغموض والجمال. تمتد على مساحات شاسعة تغطيها الرمال الذهبية التي تعانق الأفق بلا حدود. في هذه الصحراء، تجد تاريخًا مدفونًا تحت الرمال، وقصصًا ترويها الرياح التي تجوب الكثبان بلا توقف. واحدة من أعظم عجائب الصحراء العربية هي الربع الخالي، تلك الصحراء التي تعتبر أكبر صحراء رملية متصلة في العالم. بين كثبانها العالية وهدوئها الساحر، تبرز مشاعر الدهشة والانبهار. في هذه الصحراء عاش البدو منذ آلاف السنين، أشخاصٌ تعلموا أن يواجهوا قسوة الطبيعة بحكمة وشجاعة. وعلى مر العصور، كانت الصحراء العربية مصدر إلهام للشعراء والكتاب. لقد تغنّى امرؤ القيس بجمالها، ووصفها في قصائده بأنها بحر من الرمال. ومنذ ذلك الحين، ظلت الصحراء رمزًا للحرية والمغامرة. إلى جانب جمالها، تحمل الصحراء كنوزًا مخفية، مثل مدينة البتراء في الأردن، التي كانت يومًا ما بوابة للتجارة في قلب الصحراء. ومدينة العلا في السعودية، بجمالها الطبيعي وآثارها العريقة، تُعد شاهدًا على حضارات ازدهرت وسط هذا الجمال الطبيعي. الصحراء ليست فقط مكانًا، بل هي تجربة تُعلم الإنسان معنى الصبر والقوة، وتدفعه إلى استكشاف المجهول.",
        "Summary": "يتناول النص جمال وغموض الصحراء العربية، خاصة الربع الخالي، ودورها التاريخي والثقافي. يستعرض حياة البدو، وإلهام الصحراء للشعراء، مع ذكر معالم شهيرة مثل البتراء والعلا.",
        "Category": "Long",
        "Topic": " أسرار الصحراء العربية",
        "Split": "Train"
    },
    {
        "ID": 41,
        "Document": "فقدان الوزن بطريقة صحية يتطلب الالتزام بنمط حياة متوازن يركز على الغذاء الصحي والنشاط البدني، حيث لا يهدف فقط إلى التخلص من الكيلوغرامات الزائدة، بل تحسين الصحة العامة والحفاظ على النتائج على المدى الطويل. تعديل النظام الغذائي هو الخطوة الأولى، وينصح بتقليل استهلاك السعرات الحرارية بشكل معتدل بدلاً من الحميات القاسية، من خلال تقليل الأطعمة ذات السعرات العالية مثل الحلويات والمقالي، وزيادة تناول الفواكه والخضروات والبروتينات الصحية، واختيار الحبوب الكاملة بدلاً من المكررة، والابتعاد عن المشروبات السكرية لصالح الماء. النشاط البدني يلعب دورًا أساسيًا في فقدان الوزن، حيث يُوصى بممارسة التمارين بانتظام، مثل المشي السريع أو ركوب الدراجة لمدة 30 دقيقة يوميًا، مما يساعد على حرق السعرات وزيادة معدل الأيض، إضافة إلى تحسين الصحة النفسية وتقليل التوتر. جودة النوم لها أهمية كبيرة، حيث تؤثر قلة النوم سلبًا على هرمونات الجوع والشبع، مما يزيد من احتمالية الإفراط في تناول الطعام، لذا يُنصح بالحصول على 7-8 ساعات من النوم الجيد يوميًا. الالتزام هو المفتاح لتحقيق النتائج، ففقدان الوزن يتطلب الصبر والاستمرارية، مع التركيز على التحسين الشخصي بدلاً من المقارنة بالآخرين لتعزيز الدافعية. في النهاية، فقدان الوزن بطريقة صحية ليس مجرد هدف، بل رحلة لتحسين نمط الحياة، حيث يحقق التوازن بين الغذاء الصحي والنشاط البدني مع العناية بالصحة النفسية رحلة مستدامة ومثمرة.",
        "Summary": "يتناول النص خطوات فقدان الوزن بطريقة صحية تشمل تعديل النظام الغذائي بتقليل السعرات الحرارية وزيادة تناول الأطعمة الصحية، ممارسة التمارين الرياضية بانتظام لتحسين اللياقة وحرق السعرات، تحسين جودة النوم لدعم التوازن الهرموني، والالتزام المستمر لتحقيق نتائج مستدامة.",
        "Category": "Medium",
        "Topic": "كيفية فقدان الوزن بطريقة صحية",
        "Split": "Train"
    },
    {
        "ID": 9,
        "Document": "التوعية البيئية أصبحت أكثر أهمية من أي وقت مضى مع تزايد التحديات البيئية. التغير المناخي، تلوث المياه، وقطع الغابات تُهدد مستقبل كوكبنا. التوعية تبدأ بالتعليم، حيث يجب تعليم الأجيال الجديدة أهمية حماية البيئة والحفاظ على الموارد الطبيعية. يمكن للأفراد المساهمة بطرق بسيطة مثل تقليل استهلاك البلاستيك وإعادة التدوير. الشركات والحكومات تلعب دورًا رئيسيًا في تبني سياسات مستدامة.",
        "Summary": "التوعية البيئية تُسهم في ضمان مستقبل مستدام للأجيال القادمة.",
        "Category": "Medium",
        "Topic": "التوعية البيئية",
        "Split": "Validation"
    },
    {
        "ID": 76,
        "Document": "السعادة هي حالة من الرضا والفرح الداخلي التي يسعى الإنسان إلى تحقيقها في مختلف جوانب حياته، وهي مفهوم متعدد الأبعاد يتأثر بعوامل نفسية، اجتماعية، وروحية. لا تُعتبر السعادة مجرد غياب للألم أو الحزن، بل هي شعور إيجابي نابع من التوازن والانسجام بين ما يريده الإنسان وما يعيشه بالفعل. تختلف مفاهيم السعادة من شخص لآخر؛ فالبعض يجدها في تحقيق النجاح المهني، بينما يراها آخرون في العلاقات الإنسانية أو التأمل الروحي. أسرار تحقيق السعادة تكمن في مجموعة من العوامل التي تبدأ من الداخل. أولًا، العيش بوعي وقبول الذات يُعد أساسًا لتحقيق السعادة، حيث يساعد الإنسان على التصالح مع نفسه وتقدير ما لديه بدلاً من التركيز على ما ينقصه. ثانيًا، الامتنان هو أحد أقوى مفاتيح السعادة، حيث أظهرت الدراسات أن التعبير عن الشكر والتقدير للآخرين يعزز الشعور بالرضا ويقلل من التوتر. ثالثًا، العلاقات الاجتماعية القوية والاهتمام بالأسرة والأصدقاء تُعد من أهم مصادر السعادة، فالشعور بالانتماء والدعم يخلق بيئة نفسية إيجابية تُعزز الشعور بالفرح. بالإضافة إلى ذلك، يُعتبر الاهتمام بالصحة الجسدية والعقلية أمرًا أساسيًا لتحقيق السعادة؛ فالرياضة المنتظمة، والتغذية السليمة، والنوم الكافي تؤثر بشكل كبير على الحالة النفسية. كما أن ممارسة التأمل أو اليوغا يساعد على تهدئة العقل وتخفيف القلق، مما يزيد من مستويات السعادة. من جانب آخر، العمل على تحقيق الأهداف الشخصية والمهنية يعزز الشعور بالإنجاز والرضا، ولكن من المهم أن تكون هذه الأهداف واقعية ومتناسبة مع قدرات الفرد. السعادة أيضًا مرتبطة بالعطاء والمساهمة في حياة الآخرين، حيث أن تقديم المساعدة أو التطوع يعزز الشعور بالقيمة الذاتية ويخلق نوعًا من السعادة المستدامة. وأخيرًا، فإن الحفاظ على التوازن بين العمل والحياة الشخصية يعتبر مفتاحًا لتحقيق السعادة، حيث يمنح الإنسان الوقت للاستمتاع بلحظات بسيطة ومهمة مع أحبائه. على الرغم من كل هذه الجوانب، تبقى السعادة قرارًا داخليًا ينبع من اختيار الإنسان للتركيز على الجوانب الإيجابية في حياته والتكيف مع التحديات، مع العلم أن السعادة ليست حالة دائمة، بل هي لحظات تُبنى وتتجدد مع مرور الوقت ومع التجارب التي يمر بها الإنسان.",
        "Summary": "السعادة هي رحلة مستمرة تتطلب توازنًا بين الجوانب المادية والمعنوية للحياة، حيث يعتمد تحقيقها على فهم الذات، بناء العلاقات الإيجابية، والعيش بوعي كامل للحاضر، ومع أن التحديات قد تعترض الطريق، يمكن للجميع السعي نحو السعادة من خلال اتخاذ خطوات بسيطة وفعّالة تعزز الرضا والفرح.",
        "Category": "Long",
        "Topic": "السعادة مفهومها وأسرار تحقيقها",
        "Split": "Train"
    },
    {
        "ID": 30,
        "Document": "علم الفيزياء هو العلم الذي يسعى لفهم القوانين الأساسية التي تحكم الكون، من حركة الكواكب إلى أصغر الجسيمات دون الذرية، ويلعب دورًا مركزيًا في تفسير الظواهر الطبيعية. هذا العلم ليس مجرد نظريات معقدة، بل هو الأساس الذي بنيت عليه التكنولوجيا الحديثة. أحد أهم مفاهيم الفيزياء هو الطاقة، حيث توجد الطاقة في كل شيء حولنا وتجعل الحياة ممكنة. من خلال دراسة أشكال الطاقة المختلفة، مثل الطاقة الحركية والحرارية، تمكن العلماء من تطوير تقنيات مثل الطاقة الشمسية والطاقة النووية. بالإضافة إلى ذلك، فإن قوانين الحركة التي وضعها نيوتن تعتبر من الأسس التي ساهمت في تطور العلوم الأخرى. في القرن العشرين، أحدثت نظرية النسبية لأينشتاين وثورة ميكانيكا الكم تغييرًا جذريًا في فهمنا للكون، وساهمت هذه النظريات في تطوير تقنيات حديثة مثل أجهزة الكمبيوتر والاتصالات اللاسلكية. الفيزياء ليست فقط علمًا نظريًا، بل هي أيضًا وسيلة لفهم الكون من حولنا، بدءًا من الانفجار العظيم إلى توسع الكون. التحديات في علم الفيزياء لا تزال قائمة، حيث يسعى العلماء إلى توحيد النظريات المختلفة لفهم كل شيء من أصغر الجسيمات إلى أكبر المجرات. الفيزياء تذكرنا بأن الفضول العلمي لا حدود له، وأن سعينا لفهم الكون يجعلنا جزءًا من هذا العالم الواسع.",
        "Summary": "يتحدث النص عن علم الفيزياء وأهميته في تفسير الظواهر الطبيعية وتطوير التكنولوجيا،مع التركيز على النظريات الحديثة مثل النسبية وميكانيكا الكم.",
        "Category": "Short",
        "Topic": "علم الفيزياء وتفسير ظواهر الطبيعة",
        "Split": "Train"
    },
    {
        "ID": 56,
        "Document": "الأرق هو اضطراب شائع يؤثر على قدرة الشخص على النوم أو البقاء نائمًا، مما يؤدي إلى الإرهاق وصعوبة التركيز خلال النهار، وغالبًا ما يكون ناتجًا عن التوتر، القلق، أو العادات غير الصحية. ينقسم الأرق إلى نوعين: الحاد، الذي يستمر لفترة قصيرة نتيجة ضغوط معينة، والمزمن، الذي يستمر لعدة أشهر أو أكثر، مما قد يؤثر سلبًا على الصحة العقلية والجسدية ويزيد من خطر الإصابة بالاكتئاب وأمراض القلب. تشمل العلاجات تحسين عادات النوم، مثل تجنب الكافيين قبل النوم، وفي بعض الحالات قد يتطلب الأمر العلاج السلوكي أو الأدوية.",
        "Summary": "الأرق اضطراب يؤثر على النوم والصحة العامة، ويمكن علاجه بتغيير نمط الحياة أو العلاج الطبي عند الضرورة.",
        "Category": "Short",
        "Topic": "الأرق الكابوس الليلي",
        "Split": "Train"
    },
    {
        "ID": 123,
        "Document": "الأطباء هم حجر الأساس في أنظمة الرعاية الصحية، حيث يلعبون دوراً محورياً في الحفاظ على صحة الإنسان. يتخصص الأطباء في مجالات متعددة مثل الجراحة، طب الأطفال، والأمراض الباطنية، مما يتيح توفير رعاية شاملة ومتكاملة. يتطلب العمل الطبي مهارات علمية وإنسانية، حيث يجب أن يتمتع الطبيب بالمعرفة العميقة والقدرة على التعامل مع المرضى بإنسانية وتعاطف. على الرغم من التحديات التي تواجه الأطباء، مثل الضغط النفسي وساعات العمل الطويلة، فإن دورهم لا يمكن الاستغناء عنه. الأطباء هم أيضاً صمام أمان خلال الأزمات الصحية، مثل جائحة كورونا، حيث يقفون في الصفوف الأمامية لحماية المجتمع",
        "Summary": "الأطباء هم العمود الفقري للرعاية الصحية، يجمعون بين المهارات العلمية والإنسانية لتقديم رعاية شاملة.",
        "Category": "Long",
        "Topic": "doctors",
        "Split": "Train"
    },
    {
        "ID": 122,
        "Document": "المرايا هي أدوات تعكس الصورة باستخدام سطح أملس لامع، وتُعد جزءاً أساسياً من حياة الإنسان. تُستخدم في العديد من الأغراض اليومية مثل التجميل، الحلاقة، وزيادة الإضاءة في الأماكن المغلقة. تُعتبر المرايا أيضاً وسيلة لاستكشاف الفضاء، حيث تُستخدم في التلسكوبات لتجميع الضوء من الأجرام السماوية. بالإضافة إلى ذلك، تحمل المرايا أهمية رمزية في العديد من الثقافات، حيث تعبر عن التأمل واكتشاف الذات. تقنياً، تعمل المرايا على أساس انعكاس الضوء، حيث يرتد الضوء عن سطحها المصقول ليشكل صورة واضحة. هذه الخصائص جعلتها تُستخدم في تقنيات مبتكرة مثل الليزر والألياف البصرية.",
        "Summary": "لمرايا أدوات أساسية تُستخدم في الحياة اليومية والعلوم، تجمع بين الجوانب العملية والرمزية.",
        "Category": "Long",
        "Topic": "mirrors",
        "Split": "train"
    },
    {
        "ID": 31,
        "Document": "علم الكيمياء هو العلم الذي يدرس المواد وتركيبها وتفاعلاتها، ويعتبر أساسًا لفهم العالم المادي، حيث يشرح كيف تتفاعل المواد لتكوين كل شيء من حولنا. من خلال الكيمياء، نستطيع تحويل المواد البسيطة إلى مركبات معقدة ذات استخدامات متعددة. أحد الإنجازات الكبرى في الكيمياء هو تطوير الأدوية، فمن خلال فهم التفاعلات الكيميائية في الجسم، تمكن العلماء من ابتكار أدوية تعالج أمراضًا كانت تعتبر مستعصية في الماضي. بالإضافة إلى ذلك، يلعب علم الكيمياء دورًا مهمًا في الصناعة، حيث يساهم في تصنيع البلاستيك والمعادن والمستحضرات التجميلية. الكيمياء ليست فقط عن المعامل والتجارب، بل هي أيضًا علم يرتبط بحياتنا اليومية، فمن الصابون الذي نستخدمه إلى الوقود الذي يشغل سياراتنا، الكيمياء موجودة في كل مكان. ومع ذلك، فإن هذا العلم يواجه تحديات بيئية، مثل تطوير مواد صديقة للبيئة وتقنيات للتخلص من النفايات. علم الكيمياء يذكرنا بأن كل شيء في الكون متصل، وأن فهم التفاعلات الكيميائية هو مفتاح لتطوير حلول مبتكرة للمشاكل التي تواجه البشرية.",
        "Summary": "يستعرض النص علم الكيمياء وأهميته في فهم المواد وتطوير الصناعات والأدوية، مع الإشارة إلى التحديات البيئية التي تواجه هذا المجال.",
        "Category": "Short",
        "Topic": "علم الكيمياء وابتكار المواد",
        "Split": "Test"
    },
    {
        "ID": 138,
        "Document": " الجدات هن شخصيات مركزية في حياة العائلات، يجمعن بين الحنان والحكمة. دور الجدة يتجاوز دور الأمومة، حيث يُعتبرن نبعاً للتقاليد والقيم العائلية. الجدات غالباً ما يكنّ مصدر الإلهام والدعم للأطفال، حيث يقدمْن الحكايات المليئة بالدروس والحكم. يمتلكن قدرة فريدة على تهدئة الأزمات وبناء جسور بين الأجيال المختلفة. الجدة تمثل أيضاً الرابط بين الماضي والحاضر، حيث يحملْن ذكريات وتجارب لا تُقدر بثمن. في المجتمعات الحديثة، يستمر دور الجدة كعنصر استقرار ودعم، سواء في رعاية الأحفاد أو في تقديم الحكمة.",
        "Summary": "الجدات هن نبع للحنان والحكمة، يمثلن رابطاً بين الأجيال ويعززن التقاليد والقيم العائلية.",
        "Category": "Long",
        "Topic": "Grandmothers",
        "Split": "Validations"
    },
    {
        "ID": 105,
        "Document": "الموسيقى تُعتبر لغة عالمية لأنها تتجاوز الحواجز اللغوية والثقافية. يمكن لشخص لا يفهم لغة معينة أن يستمتع بموسيقى تلك اللغة بسبب اللحن والإيقاع. الموسيقى تعزز التفاهم بين الثقافات وتعمل كوسيلة للتقارب الإنساني.",
        "Summary": "الموسيقى لغة عالمية تعبر عن المشاعر وتتجاوز الحواجز الثقافية، مما يسهم في تعزيز التفاهم العالمي.",
        "Category": "Short",
        "Topic": "Music",
        "Split": "Train"
    },
    {
        "ID": 114,
        "Document": "جوز الهند هو فاكهة استوائية متعددة الاستخدامات تُزرع في العديد من المناطق حول العالم، خاصة في المناطق الساحلية. يتميز بصلابته الخارجية ولبه الأبيض اللذيذ الذي يحتوي على العديد من العناصر الغذائية المهمة مثل الفيتامينات والمعادن. يُستخدم ماء جوز الهند كمشروب منعش وغني بالإلكتروليتات، مما يجعله خياراً صحياً للترطيب. بالإضافة إلى ذلك، يُستخدم زيت جوز الهند في الطهي ومستحضرات التجميل، حيث يُعرف بفوائده للبشرة والشعر. الألياف المستخرجة من القشرة تُستخدم في صنع الحبال والفرش، مما يبرز قيمته الاقتصادية والبيئية.",
        "Summary": "جوز الهند فاكهة متعددة الاستخدامات تُستخدم في الغذاء، التجميل، والصناعات، وتتميز بفوائدها الصحية والاقتصادية",
        "Category": "Medium",
        "Topic": "Coconut",
        "Split": "Validation"
    },
    {
        "ID": 26,
        "Document": "القراءة هي نافذة على العالم ووسيلة لاكتساب المعرفة. منذ القدم، كانت القراءة رفيقًا للإنسان في رحلته لفهم الكون وتطوير الذات، حيث تحمل الكتب في صفحاتها أفكارًا وتجارب تعكس عوالم مختلفة وتفتح آفاقًا جديدة. من أهم فوائد القراءة أنها توسع الخيال وتعزز القدرات الإبداعية؛ فعند قراءة الروايات، مثل تلك التي كتبها الأديب المصري نجيب محفوظ، ينتقل القارئ إلى أماكن وأزمنة مختلفة، بينما في الكتب العلمية يتعلم الإنسان التفكير النقدي والمنهجي. القراءة أيضًا تقوي اللغة وتحسن مهارات التعبير، وتساعد على تقليل التوتر حيث ينغمس القارئ في عالم مختلف يمنحه استراحة ذهنية من ضغوط الحياة اليومية. لكنها ليست مجرد هواية، بل وسيلة للتغيير، فقد كان قادة العالم ومفكروه مثل غاندي ونيلسون مانديلا يقرؤون باستمرار لتحسين أنفسهم وفهم الآخرين. القراءة تمنح الإنسان الفرصة لفهم الثقافات المختلفة وتطوير تعاطفه مع الآخرين، كما تلعب دورًا مهمًا في بناء شخصية الأطفال بتعزيز الفضول وتشجيع التفكير المستقل. القراءة الإلكترونية أصبحت جزءًا من حياة الكثيرين، حيث توفر الكتب الإلكترونية والمقالات على الإنترنت وصولًا سهلًا للمعلومات، ومع ذلك يبقى للكتب الورقية سحرها الخاص. في النهاية، تظل القراءة مفتاحًا للمعرفة وقوة للتغيير الإيجابي.",
        "Summary": "تسلط القراءة الضوء على فوائدها المتعددة، من تعزيز الخيال وتطوير التفكير إلى تحسين اللغة والتأثير في التغيير الشخصي والاجتماعي.",
        "Category": "Long",
        "Topic": "أسرار القراءة وفوائدها",
        "Split": "Train"
    },
    {
        "ID": 42,
        "Document": "يتناول النص خطوات فقدان الوزن بطريقة صحية تتطلب الالتزام بنمط حياة متوازن يركز على الغذاء الصحي والنشاط البدني، حيث لا يهدف فقط إلى التخلص من الكيلوغرامات الزائدة، بل تحسين الصحة العامة والحفاظ على النتائج على المدى الطويل. تعديل النظام الغذائي هو الخطوة الأولى، وينصح بتقليل استهلاك السعرات الحرارية بشكل معتدل بدلاً من الحميات القاسية، من خلال تقليل الأطعمة ذات السعرات العالية مثل الحلويات والمقالي، وزيادة تناول الفواكه والخضروات والبروتينات الصحية، واختيار الحبوب الكاملة بدلاً من المكررة، والابتعاد عن المشروبات السكرية لصالح الماء. النشاط البدني يلعب دورًا أساسيًا في فقدان الوزن، حيث يُوصى بممارسة التمارين بانتظام، مثل المشي السريع أو ركوب الدراجة لمدة 30 دقيقة يوميًا، مما يساعد على حرق السعرات وزيادة معدل الأيض، إضافة إلى تحسين الصحة النفسية وتقليل التوتر. جودة النوم لها أهمية كبيرة، حيث تؤثر قلة النوم سلبًا على هرمونات الجوع والشبع، مما يزيد من احتمالية الإفراط في تناول الطعام، لذا يُنصح بالحصول على 7-8 ساعات من النوم الجيد يوميًا. الالتزام هو المفتاح لتحقيق النتائج، ففقدان الوزن يتطلب الصبر والاستمرارية، مع التركيز على التحسين الشخصي بدلاً من المقارنة بالآخرين لتعزيز الدافعية. في النهاية، فقدان الوزن بطريقة صحية ليس مجرد هدف، بل رحلة لتحسين نمط الحياة، حيث يحقق التوازن بين الغذاء الصحي والنشاط البدني مع العناية بالصحة النفسية رحلة مستدامة ومثمرة.",
        "Summary": "يتناول النص أسباب عظمة مسلسل فايكينغز، بما في ذلك واقعيته التاريخية، القصة المثيرة، الأداء التمثيلي القوي، الإخراج المذهل، والموسيقى التصويرية. يركز النص على كيفية استكشاف المسلسل لموضوعات مثل الإيمان والسلطة، ويبرز تأثيره المستمر على الثقافة الشعبية.",
        "Category": "Long",
        "Topic": " لماذا يُعتبر مسلسل فايكينغز رائعًا؟",
        "Split": "Validation"
    },
    {
        "ID": 20,
        "Document": "ثلاثية باتمان من إخراج كريستوفر نولان تُعد واحدة من أبرز الأعمال السينمائية في عالم الأبطال الخارقين. تتناول السلسلة رحلة بروس واين من الانتقام إلى أن يصبح باتمان، المدافع عن مدينة غوثام. تتميز السلسلة بشخصياتها العميقة، مثل الجوكر وباين، وحبكتها المعقدة التي تجمع بين الأكشن والفلسفة.",
        "Summary": "ثلاثية باتمان تروي قصة بروس واين وتحوله إلى باتمان، مع مواجهة أعداء مثل الجوكر وباين.",
        "Category": "Short",
        "Topic": "ثلاثية باتمان - كريستوفر نولان",
        "Split": "Train"
    },
    {
        "ID": 143,
        "Document": "الاتهامات الكاذبة هي مشكلة اجتماعية خطيرة يمكن أن تدمر سمعة الأفراد وحياتهم. تحدث عندما يتم اتهام شخص بجريمة أو فعل لم يرتكبه، مما يؤدي إلى عواقب نفسية واجتماعية جسيمة. يمكن أن تكون الأسباب وراء هذه الاتهامات متنوعة، من الانتقام الشخصي إلى التلاعب القانوني. تأثير هذه الاتهامات يمتد ليشمل عائلات وأصدقاء المتهم، مما يخلق بيئة من الشك وعدم الثقة. القضاء على هذه الظاهرة يتطلب تحقيق العدالة من خلال جمع الأدلة بعناية وضمان حقوق جميع الأطراف.",
        "Summary": "الاتهامات الكاذبة تضر بالأفراد والمجتمع، وتتطلب تحقيق العدالة لضمان حماية الحقوق.",
        "Category": "Long",
        "Topic": "False allegations",
        "Split": "Train"
    },
    {
        "ID": 161,
        "Document": " استوديو جيبلي هو شركة إنتاج يابانية تُعرف بأفلام الأنيميشن الرائعة. يشتهر بأعمال مثل جاري توتورو والمخطوفة. يتميز بالجودة البصرية والقصص العاطفية    .",
        "Summary": "استوديو جيبلي هو علامة بارزة في صناعة الأنيميشن، يقدم أعمالاً فنية تجمع بين الجمال والقيم الإنسانية",
        "Category": "Short",
        "Topic": "Studio Ghibli",
        "Split": "Test"
    },
    {
        "ID": 16,
        "Document": "سلسلةهاري بوتر هي واحدة من أشهر الأعمال السينمائية في العالم. تدور القصة حول هاري بوتر، الساحر الشاب الذي اكتشف أنه يمتلك قدرات خاصة بعد تلقيه دعوة للالتحاق بمدرسة هوغوورتس للسحر. يواجه هاري تحديات عديدة، أبرزها محاربة اللورد فولدمورت، الساحر الشرير الذي قتل والديه. تجمع السلسلة بين السحر والمغامرات والصداقة، وتُظهر أهمية الشجاعة والاختيار بين الخير والشر.",
        "Summary": "سلسلة هاري بوتر تروي قصة ساحر شاب يواجه تحديات ومغامرات في عالم السحر، محاربًا الشرير فولدمورت.",
        "Category": "Short",
        "Topic": "سلسلة هاري بوتر",
        "Split": "Train"
    },
    {
        "ID": 66,
        "Document": "الحرب العالمية الأولى، التي اندلعت في 28 يوليو 1914 واستمرت حتى 11 نوفمبر 1918، كانت واحدة من أعنف الصراعات في تاريخ البشرية، حيث غيرت النظام العالمي جذريًا وتركت تأثيرًا دائمًا على السياسة والمجتمع والثقافة. بدأت الحرب باغتيال الأرشيدوق فرانز فرديناند في سراييفو، مما أدى إلى تشكيل تحالفين رئيسيين: الحلفاء، الذي ضم بريطانيا وفرنسا وروسيا وإيطاليا لاحقًا، ودول المحور، التي شملت ألمانيا والنمسا-المجر والإمبراطورية العثمانية. تميزت الحرب بأساليب قتال جديدة مثل الخنادق والأسلحة الكيماوية، بينما ساهمت الابتكارات التكنولوجية مثل الطائرات والدبابات في تغيير طبيعة الحروب. كانت الحرب مكلفة للغاية، حيث قُتل أكثر من 16 مليون شخص وجُرح الملايين، وتعرضت البنية التحتية الأوروبية لدمار واسع النطاق، مما أدى إلى أزمة إنسانية مع ملايين اللاجئين والمشردين. سياسياً، أدت الحرب إلى انهيار إمبراطوريات كبرى مثل العثمانية، النمساوية-المجرية، والألمانية، وفرضت معاهدة فرساي عام 1919 شروطًا قاسية على ألمانيا، مما خلق استياءً كبيرًا وأسهم في اندلاع الحرب العالمية الثانية. اجتماعيًا، أحدثت الحرب تغييرات كبيرة، منها دخول النساء إلى سوق العمل لتعويض غياب الرجال في الجبهات، مما عزز حركة حقوق المرأة لاحقًا، كما ألهمت الحرب العديد من الأعمال الأدبية والفنية التي وثقت فظائعها وتأثيرها النفسي. رغم انتهاء الحرب في عام 1918، استمرت تأثيراتها مع محاولات لتعزيز التعاون الدولي من خلال إنشاء عصبة الأمم، التي فشلت في منع الحرب العالمية الثانية لكنها قدمت نموذجًا أوليًا لفكرة التعاون الدولي. كانت الحرب درسًا قاسيًا للبشرية، أظهرت مدى الدمار الذي يمكن أن ينجم عن الصراعات الكبرى، مما جعلها نقطة انطلاق لفهم أهمية السلام وبناء عالم أكثر استقرارًا.",
        "Summary": "الحرب العالمية الأولى كانت صراعًا عالميًا أسفر عن تغييرات جذرية في النظام السياسي والاجتماعي والثقافي. رغم تكلفتها الإنسانية الهائلة، قدمت دروسًا حول أهمية السلام والتعاون الدولي.",
        "Category": "Long",
        "Topic": " الحرب العالمية الأولى الصراع الذي غيّر مسار التاريخ",
        "Split": "Validation"
    },
    {
        "ID": 40,
        "Document": "الحياة هبة عظيمة مليئة بالجمال والتجارب التي تستحق التأمل والتقدير. رغم التحديات والصعوبات التي قد تواجهنا، فإن جمال الحياة يكمن في قدرتها على تقديم لحظات من الفرح والسعادة، حتى في أبسط التفاصيل. إن جمال الحياة ليس فقط في لحظاتها الكبيرة، بل في اللحظات اليومية الصغيرة التي تضفي عليها معنى خاصًا. أحد جوانب جمال الحياة هو التنوع الذي يقدمه العالم من حولنا. الطبيعة، على سبيل المثال، تعكس جمالًا لا مثيل له. من غروب الشمس الذي يلون السماء بألوان دافئة، إلى رائحة الزهور في صباح يوم ربيعي، كل جزء من الطبيعة يذكرنا بعظمة الخلق وسحره. حتى أصغر الكائنات، مثل الفراشات والطيور، تساهم في لوحة الحياة المليئة بالألوان والحركة. العلاقات الإنسانية هي جانب آخر من جمال الحياة. الأصدقاء، العائلة، الأحباء، جميعهم يشكلون شبكة من الدعم والحب التي تضفي معنى ودفئًا على حياتنا. مشاركة لحظات الفرح، مثل الاحتفال بنجاح أو ميلاد، ومساندة بعضنا البعض في أوقات الحزن، تجعل الحياة أكثر جمالًا وإنسانية. العلاقات الإنسانية تعلمنا أهمية التعاطف والمشاركة، وتجعلنا ندرك أن الحياة ليست فقط ما نحققه، بل من نشاركه. الإبداع هو أيضًا جزء لا يتجزأ من جمال الحياة. الفنون، الموسيقى، الأدب، والرقص تعبر عن الروح البشرية وتسمح لنا بالتعبير عن أنفسنا بطرق فريدة. عندما نستمع إلى مقطوعة موسيقية مؤثرة، أو نقرأ قصيدة تلهمنا، نشعر بالاتصال بجمال أعمق يعبر عن طبيعة الإنسان. اللحظات البسيطة تحمل جمالًا خاصًا قد يغفل عنه الكثيرون. كوب قهوة في الصباح، ابتسامة من طفل، أو حتى لحظة هدوء تحت سماء مليئة بالنجوم. هذه اللحظات قد تبدو صغيرة، لكنها تحمل في طياتها طاقة إيجابية تمنحنا شعورًا بالسلام والرضا. التقدير لهذه اللحظات يساعدنا على العيش بوعي وتقدير أكبر. التحديات التي نواجهها في الحياة ليست بالضرورة نقيضًا لجمالها، بل هي جزء منه. الألم والصعوبات يعلموننا الصبر ويجعلوننا نقدر لحظات السعادة بشكل أكبر. مثلما لا يمكننا تقدير النور دون المرور بالظلام، فإن الصعوبات تجعلنا ندرك قيمة الأشياء الجميلة التي نملكها. السفر واستكشاف العالم هو أيضًا جزء من جمال الحياة. التجول في أماكن جديدة، التعرف على ثقافات مختلفة، وتذوق أطعمة غريبة كلها تجارب تضيف أبعادًا جديدة لحياتنا. السفر يذكرنا بمدى تنوع وجمال العالم، ويعلمنا أن الحياة مليئة بالمفاجآت والفرص. جمال الحياة يكمن أيضًا في النمو الشخصي. كل تجربة، سواء كانت جيدة أو سيئة، تساهم في تشكيل شخصيتنا. التعلم من الأخطاء، تحقيق الأهداف، وتطوير المهارات هي أمور تجعلنا نشعر بأننا نعيش حياة ذات معنى. هذه الرحلة الشخصية نحو الأفضل هي جزء أساسي من جمال الحياة. في النهاية، جمال الحياة ليس شيئًا نبحث عنه بعيدًا، بل هو موجود حولنا وفي داخلنا. يكمن الجمال في قدرتنا على رؤية النعم الصغيرة وتقديرها، وفي إيماننا بأن الغد يحمل دائمًا فرصًا جديدة. عندما ننظر إلى الحياة بعين الامتنان والتفاؤل، نكتشف أن الجمال ليس فقط في الأشياء، بل في الطريقة التي نعيش بها.",
        "Summary": "يستعرض النص جمال الحياة من خلال الطبيعة، العلاقات الإنسانية، اللحظات البسيطة، الإبداع، والتحديات التي تواجهنا. يركز على أهمية تقدير التفاصيل الصغيرة ورؤية الجمال في كل جوانب الحياة، مع التشديد على التفاؤل والنمو الشخصي.",
        "Category": "Long",
        "Topic": "جمال الحياة احتفاء باللحظات البسيطة",
        "Split": "Train"
    },
    {
        "ID": 55,
        "Document": "مارلين مونرو، وُلدت باسم نورما جين مورتنسن عام 1926، تُعد واحدة من أبرز الشخصيات في تاريخ السينما والثقافة الشعبية، حيث أصبحت رمزًا للجمال والإغراء وموهبة فنية حقيقية رغم حياتها القصيرة التي انتهت عام 1962. بدأت مسيرتها كعارضة أزياء قبل دخول عالم السينما في أواخر الأربعينيات، واشتهرت بأدوارها في أفلام مثل البعض يفضلونها ساخنة وموقف الحافلات، حيث أظهرت موهبة كوميدية ودرامية مميزة، وأصبحت واحدة من أعلى الممثلات أجرًا في هوليوود بفضل التزامها وجهودها لتحسين أدائها. رغم شهرتها، كانت حياتها مليئة بالتحديات، حيث عانت من صعوبات نفسية وشخصية شملت زيجات فاشلة وعلاقات مضطربة، إضافة إلى صدمات الطفولة التي عاشتها في دور رعاية. وفاتها المفاجئة عن عمر 36 عامًا أثارت جدلًا واسعًا حول أسبابها، لكنها جعلتها رمزًا خالدًا في عالم الفن والجمال.",
        "Summary": "مارلين مونرو أيقونة جمال وموهبة، تألقت في السينما رغم صعوبات حياتها، وما زالت تُلهم الأجيال.",
        "Category": "Short",
        "Topic": "مارلين مونرو أيقونة الجمال والموهبة",
        "Split": "Train"
    }
]